    
/*
    84 - Акицу Мару  | Akitsu Maru  | 1942-01-30   | 1944-11-15 | торпедирован SS-393 Queenfish
    85 - Нигицу Мару | Nigitsu Maru | 1943-03-15   | 1944-01-12 | торпедирован SS-256 Hake 23°15' с.ш. 132°51' в.д.
*/
    
    
/* характеристики */
insert into general
    (ship_id, date_from, date_to, 
     displacement_standart, displacement_full, 
     length, width, draft,
     crew, speed_max, speed_cruise, range)
    values
    (84, '1942-01-30', '1944-11-15',    11800, 11800,   143.74, 20.0, 7.85,  null, 20, null, null),
    (85, '1943-03-15', '1944-01-12',    11800, 11800,   143.74, 20.0, 7.85,  null, 20, null, null);

    
    
/* модернизации */
insert into ship_event_list
    (class_id, ship_id, date_from, date_to, description)
    values
    (1, 84, '1943-04-29', '1943-05-02', 'Сингапур, с помощью ремонтной секции 101'),
    (7, 84, '1943-11-18', '1943-11-18', 'атакован SS-291 Crevalle, торпеды не сдетонировали'),
    (0, 84, '1944-04-13', '1944-07-30', 'Аиои, установлена полетная палуба и лифт'),
    (7, 84, '1944-11-14', '1944-11-14', 'покидает залив Имари с конвоем HI-81, на борту среди прочего 104 лодки-снаряды Мару-ни'); /* Maru-ni */
    
    
    
/* орудия ГК */
insert into ship_guns
    (ship_id, mount_id, amount, date_from, date_to)
    values
    (84, 67, 10, '1942-01-30', '1944-04-13'),
    (85, 67, 10, '1943-03-15', '1944-01-12');
    
    
    
/* ПВО */
insert into ship_guns
    (ship_id, mount_id, amount, date_from, date_to)
    values
    (84, 57,  2, '1942-01-30', '1944-11-15'),
    (84, 43,  6, '1944-07-30', '1944-11-15'),
    (85, 57,  2, '1943-03-15', '1944-01-12');

    

/*
    Акицу Мару до 13.04.1944
    Нигицу Мару
        до 27 десантных барж Дайхацу
*/

    
    
/* авиагруппа */
/* Акицу Мару с 30.07.1944 1 подъемник на корме */
insert into ship_aircraft
    (ship_id, aircraft_id, amount, amount_reserve, date_from, date_to)
    values
    (84,  55, 0, 30, '1942-11-23', '1944-04-13'), /* Ki-76 */ /* неточное количество */
    (84,  55, 7,  0, '1944-07-30', '1944-11-14'), /* Ki-76 */ /* по другим данным 8 самолетов */
    (84, 144, 2,  0, '1944-11-14', '1944-11-15'), /* Ka-1  */
    (85,  55, 0, 30, '1943-03-15', '1944-01-12'); /* Ki-76 */ /* неточное количество */

