    
/*
    65 - Дзуйхо
    66 - Сехо
*/
    
    
/* характеристики */
insert into general
    (ship_id, date_from, date_to, 
     displacement_standart, displacement_full, 
     length, width, draft,
     crew, speed_max, speed_cruise, range)
    values
    (65, '1940-12-27', '1944-06-01',    11262, 13950,   201.4, 18.0, 6.65,  785, 28, 18, 12500),
    (65, '1944-06-01', '1944-10-25',    11290, 14005,   201.4, 18.0, 6.65,  785, 28, 18, 12500),
    (66, '1942-01-26', '1942-05-07',    11260, 13940,   201.4, 18.0, 6.65,  785, 28, 18, 12500);

    
    
/* модернизации */
insert into ship_event_list
    (class_id, ship_id, date_from, date_to, description)
    values
    (1, 65, '1941-11-15', '1941-11-25', 'Сасебо'),
    (6, 65, '1942-05-29', '1942-05-29', 'прием авиагруппы'),
    (0, 65, '1942-07-20', '1942-07-25', 'Сасебо'), /* по другим данным в Куре */
    (0, 65, '1942-11-25', '1942-12-16', 'Сасебо'), /* по другим данным в Куре */
    (6, 65, '1943-04-26', '1943-04-26', 'прием авиагруппы'),
    (0, 65, '1943-06-07', '1943-06-15', 'Сасебо, установка радара'),
    (6, 65, '1943-09-24', '1943-09-24', 'прием авиагруппы'),
    (1, 65, '1944-02-23', '1944-03-10', 'Аиои'),
    (0, 65, '1944-07-01', '1944-07-22', 'Сасебо');
    
    
    
/* ПВО */
insert into ship_guns
    (ship_id, mount_id, amount, date_from, date_to)
    values
    (65, 13,  4, '1940-12-27', '1944-10-25'),
    (65, 46,  4, '1940-12-27', '1944-10-25'),
    (65, 45, 12, '1942-12-16', '1944-10-25'), /* точных данных нет: 48 стволов */
    (65, 44, 10, '1944-07-22', '1944-10-25'), /* точных данных нет: 68 стволов */
    (65, 61,  6, '1944-07-22', '1944-10-25'),
    
    (66, 13,  4, '1942-01-26', '1942-05-07'),
    (66, 46,  4, '1942-01-26', '1942-05-07');
    
    
    
/* радары */
insert into ship_searchers
    (ship_id, searcher_id, amount, date_from, date_to)
    values
    (65, 0, 1, '1943-06-15', '1944-10-25'); /* тип 21 мод 2 */
    
    
    
/* прожектора */
insert into ship_searchers
    (ship_id, searcher_id, amount, date_from, date_to)
    values
    (65, 30, 3, '1940-12-27', '1944-10-25'),
    (66, 30, 3, '1942-01-26', '1942-05-07');

    
    
/* авиагруппа */
/* 
    2 подъемника:
        13м * 12м
        12м * 10.8м
*/
insert into ship_aircraft
    (ship_id, aircraft_id, amount, amount_reserve, date_from, date_to)
    values
    (65, 13, 16, 0, '1940-12-27', '1942-05-29'), /* A5M2 */
    (65,  7, 12, 0, '1940-12-27', '1942-05-29'), /* B5N1 */
    (65, 13,  6, 0, '1942-05-29', '1942-07-20'), /* A5M2 */
    (65,  0,  6, 0, '1942-05-29', '1942-07-20'), /* A6M2 */
    (65,  8, 12, 0, '1942-05-29', '1942-07-20'), /* B5N2 */
    (65,  0, 18, 0, '1942-07-25', '1944-07-01'), /* A6M2 */
    (65,  8,  6, 0, '1942-07-25', '1944-07-01'), /* B5N2 */
    /* по некоторым данным (Альпаков) в интервалах
        '1943-04-26', '1943-08-13'
        '1943-09-24', '1944-07-01'
        авиагруппа была другой */
    (65,  0, 12, 2, '1944-07-22', '1944-10-25'), /* A6M2 */
    (65, 18, 15, 1, '1944-07-22', '1944-10-25'), /* D4Y1 */
    
    (66, 13,  4, 0, '1942-01-26', '1942-05-07'), /* A5M2 */
    (66,  0,  8, 0, '1942-01-26', '1942-05-07'), /* A6M2 */
    (66,  8,  6, 0, '1942-01-26', '1942-05-07'); /* B5N2 */


