    
/*
    79 - Титосе  | Chitose | 1938-07-25   | 1944-10-25 | залив Лейте, Энганьо
    80 - Тиеда   | Chiyoda | 1938-12-15   | 1944-10-25 | залив Лейте, Энганьо
*/
    
    
/* характеристики */
insert into general
    (ship_id, date_from, date_to, 
     displacement_standart, displacement_full, 
     length, width, draft,
     crew, speed_max, speed_cruise, range)
    values
    (79, '1938-07-25', '1942-11-28',    10929, 12120,   183.9, 18.8, 7.1,    800, 28.9, 18, 17700),
    (79, '1944-01-01', '1944-10-25',    11190, 13600,   185.9, 20.8, 7.51,   800, 28.9, 18, 17700),
    
    (80, '1938-12-15', '1943-01-16',    10929, 12120,   183.9, 18.8, 7.1,    800, 28.8, 18, 17700),
    (80, '1943-12-21', '1944-10-25',    11190, 13600,   185.9, 20.8, 7.51,   800, 28.8, 18, 17700);

    
    
/* модернизации */
insert into ship_event_list
    (class_id, ship_id, date_from, date_to, description)
    values
    (0, 79, '1940-10-15', '1940-12-31', 'Сасебо, дооборуован как носитель подводных лодок'), /* неточная дата окончания */
    (7, 79, '1942-02-10', '1942-02-10', 'Макассарский пролив, поврежден авиацией'),
    (1, 79, '1942-05-09', '1942-05-16', 'Сасебо'),
    (1, 79, '1942-07-20', '1942-07-23', 'Йокосука'),
    (7, 79, '1942-08-24', '1942-08-24', 'Гуадалканал, поврежден пикировщиками с CV-3 Saratoga'),
    (1, 79, '1942-08-28', '1942-08-31', 'Трук, с помощью Акаси'), /* неточная дата окончания */
    (1, 79, '1942-09-01', '1942-09-14', 'Йокосука'), /* неточная дата начала */
    (0, 79, '1942-11-28', '1944-01-01', 'Сасебо, перестройка в авианосец'),
    (1, 79, '1944-03-19', '1944-03-24', 'Йокосука'),
    (7, 79, '1944-06-26', '1944-06-26', 'авиагруппа переведена на Секаку'),
    (0, 79, '1944-07-20', '1944-07-26', 'Куре'), /* по данным Альпакова с 06.08 по 14.08 */

    (0, 80, '1940-05-23', '1940-06-23', 'Куре, дооборуован как носитель подводных лодок'),
    (1, 80, '1941-06-01', '1941-07-31', 'Куре, установка рампы для спуска подподных лодок'),
    (1, 80, '1942-06-15', '1942-06-25', 'Куре'),
    (0, 80, '1943-01-16', '1943-12-21', 'Йокосука, перестройка в авианосец'),
    (7, 80, '1944-06-20', '1944-06-20', 'попадание бомбы'),
    (0, 80, '1944-07-01', '1944-07-09', 'Куре'), /* по данным Альпакова с 16.07 по 22.07 в Сасебо */
    (7, 80, '1944-10-14', '1944-10-14', 'авиагруппа переведена на Дзуйкаку');
    
    
    
/* ПВО */
insert into ship_guns
    (ship_id, mount_id, amount, date_from, date_to)
    values
    (79, 13,  2, '1938-07-25', '1942-11-28'),
    (79, 44,  6, '1938-07-25', '1942-11-28'),
    (79, 13,  3, '1944-01-01', '1944-10-25'),
    (79, 69,  1, '1944-01-01', '1944-10-25'),
    (79, 45, 10, '1944-01-01', '1944-07-20'),
    (79, 45, 16, '1944-07-26', '1944-10-25'),

    (80, 13,  2, '1938-12-15', '1943-01-16'),
    (80, 44,  6, '1938-12-15', '1943-01-16'),
    (80, 13,  3, '1943-12-21', '1944-10-25'),
    (80, 69,  1, '1943-12-21', '1944-10-25'),
    (80, 45, 10, '1943-12-21', '1944-07-01'),
    (80, 45, 16, '1944-07-09', '1944-10-25');
    
    
    
/* радары */
insert into ship_searchers
    (ship_id, searcher_id, amount, date_from, date_to)
    values
    (79, 0, 1, '1944-01-01', '1944-10-25'), /* тип 21 */
    (80, 0, 1, '1943-12-21', '1944-10-25'); /* тип 21 */
    
    
/* прожектора */
insert into ship_searchers
    (ship_id, searcher_id, amount, date_from, date_to)
    values
    (79, 32, 3, '1938-07-25', '1944-10-25'),
    (80, 32, 3, '1938-12-15', '1944-10-25');
    
    
    
/* катапульты */
insert into ship_catapult
    (ship_id, catapult_id, amount, date_from, date_to)
    values
    (79, 10, 4, '1938-07-25', '1942-11-28'), /* по данным Альпакова Куре No 2 мод 3 */
    (80, 10, 4, '1938-12-15', '1943-01-16'); /* по данным Альпакова Куре No 2 мод 3 */
    
    
    
/* авиагруппа */
/*
    Титосе с 01.01.1944
    Тиеда с 21.12.1943
        2 самолетоподъемника
*/
insert into ship_aircraft
    (ship_id, aircraft_id, amount, amount_reserve, date_from, date_to)
    values
    (79,  30, 22, 2, '1938-07-25', '1940-10-15'), /* E7K1 */
    (79,  31, 11, 1, '1940-12-31', '1941-06-01'), /* E7K2 */ /* неточная дата окончания */
    /* с 11.1940 по 1941 12 субмарин типа A */
    (79,  37, 22, 2, '1941-06-01', '1942-05-09'), /* F1M2 */ /* неточная дата начала */
    (79,  37, 14, 2, '1942-05-16', '1942-07-20'), /* F1M2 */
    (79,  11,  5, 2, '1942-05-16', '1942-07-20'), /* E13A1 */
    (79, 148,  7, 1, '1942-07-23', '1942-11-28'), /* A6M2-N */ /* неточное количество */
    (79,  37,  7, 1, '1942-07-23', '1942-11-28'), /* F1M2 */   /* неточное количество */
    (79,  11,  5, 2, '1942-07-23', '1942-11-28'), /* E13A1 */
    (79,   0, 21, 0, '1944-01-01', '1944-06-26'), /* A6M2 */ /* неточное количество */
    (79,   8,  9, 0, '1944-01-01', '1944-06-26'), /* B5N2 */ /* неточное количество */
    (79,   0, 21, 0, '1944-07-26', '1944-10-25'), /* A6M2 */ /* по данным Альпакова 12+3 A6M2  15 D4Y1 */
    (79,   8,  9, 0, '1944-07-26', '1944-10-25'), /* B5N2 */

    (80,  31, 22, 2, '1938-12-15', '1940-05-23'), /* E7K2 */
    (80,  31, 11, 1, '1940-06-23', '1942-06-15'), /* E7K2 */
    /* с 23.06.1940 12 субмарин типа A */
    /* на 29.05.1942 имел 8 субмарин HA-28, HA-29, HA-31, HA-32, HA-33, HA-34 и еще 2 */
    (80, 148,  6, 0, '1942-06-25', '1943-01-16'), /* A6M2-N */
    /* с 28.06.1942 по 05.07.1942 имел 6 субмарин HA-28, HA-29, HA-31, HA-32, HA-33, HA-34 
       05.07.1942 выгрузил в Кыске */
    /* на 20.07.1942 имел 6 субммарин */
    /* на 14.10.1942 имел 8 субммарин */
    /* 05.07.1942 передал оставшиеся субмарины I-16 I-20 I-24 */
    (80,   0, 21, 0, '1943-12-21', '1944-10-14'), /* A6M2 */ /* неточное количество */
    (80,   8,  9, 0, '1943-12-21', '1944-10-14'), /* B5N2 */ /* неточное количество */
    (80,   0, 21, 0, '1944-10-18', '1944-10-25'), /* A6M2 */ /* неточное количество */
    (80,   8,  9, 0, '1944-10-18', '1944-10-25'); /* B5N2 */ /* неточное количество */

