
insert into aircraft_list
    (id, name_ru, name_en, class_id, type_id, crew, 
        mass, max_mass, engine_power, max_speed, cruise_speed,
        range, range_with_tank, ceiling, time_to_altitude, in_service)
    values
    (68, 'Спарроухаук 1',       'Sparrowhawk 1',    0, 29, 1, /* 2* 7.7mm vickers */
      982,  982,    230,    201, null,  600, null,  5.2,     5.5,   '1921-01-01'), /* Кисо 1921 (испытания) */

    (58, 'истребитель тип 10-2',    'Mitsubishi 1MF3',  0, 22, 1, /* 2* 7.7mm */
      940, 1280,     300,   213, null,  1014, null, 7.9,    3.3,    '1923-01-01'), /* Хосе Акаги Кага  Кисо 1922 (испытания) */
    (59, 'истребитель тип 10-2',    'Mitsubishi 1MF4',  0, 22, 1, /* 2* 7.7mm */
      940, 1280,     300,   213, null,  1014, null, 7.9,    3.3,    '1923-01-01'),
    (60, 'истребитель тип 10-2',    'Mitsubishi 1MF5',  0, 22, 1, /* 2* 7.7mm */
      940, 1280,     300,   213, null,  1014, null, 7.9,    3.3,    '1923-01-01'),

    (61, 'истребитель тип 3',       'Nakajima A1N1',    0, 23, 1, /* 2* 7.7mm */ /* 2* 30кг */
      882, 1375,     420,   241, 148,    370, null, 7,      2.0,    '1922-12-01'),
    (62, 'истребитель тип 3',       'Nakajima A1N2',    0, 23, 1, /* 2* 7.7mm */ /* 2* 30кг */
      882, 1375,     450,   241, 148,    370, null, 7,      2.0,    '1930-01-01'),

    (120, 'истребитель тип 90-1',   'Nakajima A2N1',    0, 44, 1, /* 2* 7.7mm */
     1500, 1550,     550,   292, 248,   1000, null, 9.0,    1.91,   '1931-06-01'),
    (121, 'истребитель тип 90-2',   'Nakajima A2N2',    0, 44, 1, /* 2* 7.7mm */
     1500, 1550,     550,   292, 248,   1000, null, 9.0,    1.91,   '1932-01-01'),
    (122, 'истребитель тип 90-3',   'Nakajima A2N3',    0, 44, 1, /* 2* 7.7mm */
     1500, 1550,     585,   292, 248,   1000, null, 9.0,    1.91,   '1933-01-01'),

    (125, 'истребитель тип 95',     'Nakajima A4N1',     0, 46, 1, /* 2* 7.7mm type 97 */
     1760, 1760,     544,   350, 233,    845, null, 7.74,   1.16,   '1936-01-01'),

    (12, 'истребитель тип 96 модель 1', 'Mitsubishi A5M1 Claude',       0, 4, 1, /* 2* 7.7mm type 97 */ /* 2* 30кг */
     1500, null,     580,   400, null,   700, 1200, 9.5,    1.3,    '1936-08-01'), /* Кага x2 08.37 Сасебо  Хосе 01.09.37 Сасебо  Рюхо 01.09.37 Сасебо */
    (13, 'истребитель тип 96 модель 21','Mitsubishi A5M2a Claude',      0, 4, 1, /* 2* 7.7mm type 97 */ /* 2* 30кг */
     1600, null,     610,   420, null,   700, 1200, 9.5,    1.3,    '1937-01-01'),
    (14, 'истребитель тип 96 модель 22','Mitsubishi A5M2b Claude',      0, 4, 1, /* 2* 7.7mm type 97 */ /* 2* 30кг */
     1700, null,     640,   420, null,   700, 1200, 9.5,    1.3,    '1938-01-01'),
    (15, 'истребитель тип 96 модель 23','Mitsubishi A5M3 Claude',       0, 4, 1, /* 2* 7.7mm type 97 */ /* 2* 30кг */
     1700, null,     610,   420, null,   700, 1200, 9.5,    1.3,    '1938-01-01'),
    (16, 'истребитель тип 96 модель 24','Mitsubishi A5M4 Claude',       0, 4, 1, /* 2* 7.7mm type 97 */ /* 2* 30кг */
     1700, null,     710,   430, null,   650, 1200, 9.5,    1.3,    '1939-01-01'),

    (0,  'истребитель тип 0 модель 11',     'Mitsubushi A6M2 Zero',     0, 0, 1, /* 2* 7.7mm type 97, 2* 20mm type 99 */
     2360, 2800,     940,   533, 333,   1870, 3050, 10,     1.24,   '1940-07-01'),
    (148,'гидросамолет истребитель тип 2',  'Nakajima A6M2-N Rufe',    13, 0, 1, /* 2* 7.7mm type 97, 2* 20mm type 99 */
     2460, 2880,     950,   436, 296,   1148, null, 10,     1.34,   '1942-03-01'),
    (1,  'истребитель тип 0 модель 32',     'Mitsubishi A6M3 Zero',     0, 0, 1, /* 2* 7.7mm type 97, 2* 20mm type 99 */
     2360, 3100,    1130,   544, 333,   1000, 2000, 10,     1.10,   '1942-04-01'),
    (2,  'истребитель тип 0 модель 52 Ко',  'Mitsubishi A6M5a Zero',    0, 0, 1, /* 2* 7.7mm type 97, 2* 20mm type 99 */
     2360, 3100,    1130,   565, 333,   1000, 2000, 10,     1.10,   '1943-09-01'),
    (3,  'истребитель тип 0 модель 52 Оцу', 'Mitsubishi A6M5b Zero',    0, 0, 1, /* 7.7mm type 97, 13.2mm type 3, 2* 20mm type 99 */
     2360, 3100,    1130,   565, 333,   1000, 2000, 10,     1.10,   '1944-04-01'),
    (4,  'истребитель тип 0 модель 52 Хей', 'Mitsubishi A6M5c Zero',    0, 0, 1, /* 3* 13.2mm type 3, 2* 20mm type 99 */
     2360, 3100,    1130,   565, 333,   1000, 2000, 10,     1.10,   '1944-10-01'),
    (5,  'истребитель тип 0 модель 63',     'Mitsubishi A6M7 Zero',     3, 0, 1, /* 3* 13.2mm type 3, 2* 20mm type 99 */ /* 250кг */ /*Камикадзе мог нести 500кг бомб*/
     null, null,    1130,   565, 333,   1000, 2000, 10,     1.10,   '1945-05-01'),
    (6,  'истребитель тип 0 модель 64',     'Mitsubishi A6M8 Zero',     0, 0, 1, /* 2* 13.2mm type 3, 2* 20mm type 99 */
     null, null,    1560,  null, null,  null, null, 10,     null,  null),

    (48, 'истребитель A7M',     'Mitsubishi A7M2 Reppu (Sam)',      0, 16, 1, /* 2* 20mm type 99, 2* 13.2mm type 3 */ /* 2* 250кг */
     3200, 4700,    2200,   620, 417,   2000, null, 11,     1.02,   '1944-06-01'),
    (49, 'истребитель A7M',     'Mitsubishi A7M2 Reppu (Sam)',      0, 16, 1, /* 4* 20mm type 99 */ /* 2* 250кг */
     3200, 4700,    2200,   620, 417,   2000, null, 11,     1.02,   '1944-06-01'),
    (50, 'истребитель A7M',     'Mitsubishi A7M3 Reppu (Sam)',      0, 16, 1, /* 6* 20mm type 99 */ /* 2* 250кг */
     3400, 5000,    2300,   640, 417,   2000, null, 11,     1.02,   '1944-07-01'),

    (105, 'истребитель тип 1',  'Ki-43-1a Hayabusa (Oscar)',        0, 40, 1, /* 2* 7.7mm type 89 */
     2500, 2800,    1100,   558, 440,   1500, null, 11,     1.09,   '1941-04-01'),
    (106, 'истребитель тип 1',  'Ki-43-1b Hayabusa (Oscar)',        0, 40, 1, /* 1* 12.7mm type 1 (HO-103), 7.7mm type 89 */
     2500, 2800,    1100,   558, 440,   1500, null, 11,     1.09,   '1941-06-01'),
    (107, 'истребитель тип 1',  'Ki-43-1c Hayabusa (Oscar)',        0, 40, 1, /* 2* 12.7mm type 1 (HO-103) */ /* 2* 30кг */
     2500, 2800,    1100,   558, 440,   1500, null, 11,     1.09,   '1942-06-01'),
    (108, 'истребитель тип 1',  'Ki-43-2a Hayabusa (Oscar)',        0, 40, 1, /* 2* 12.7mm type 1 (HO-103) */ /* 2* 250кг */
     2590, 2925,    1300,   530, 440,   1760, null, 11.2,   1.16,   '1942-02-01'),
    (109, 'истребитель тип 1',  'Ki-43-2b Hayabusa (Oscar)',        0, 40, 1, /* 2* 12.7mm type 1 (HO-103) */ /* 2* 250кг */
     2590, 2925,    1300,   530, 440,   1760, null, 11.2,   1.16,   '1943-05-01'),
    (110, 'истребитель тип 1',  'Ki-43-2-Kai Hayabusa (Oscar)',     0, 40, 1, /* 2* 12.7mm type 1 (HO-103) */ /* 2* 250кг */
     2590, 2925,    1330,   530, 440,   1760, null, 11.2,   1.16,   '1942-07-01'),
    (111, 'истребитель тип 1',  'Ki-43-3 Hayabusa (Oscar)',         0, 40, 1, /* 2* 12.7mm type 1 (HO-103) */ /* 2* 250кг */
     2590, 2925,    1230,   530, 440,   1760, null, 11.2,   1.16,   '1944-05-01'),
    (112, 'истребитель тип 1',  'Ki-43-3a Hayabusa (Oscar)',        0, 40, 1, /* 2* 12.7mm type 1 (HO-103) */ /* 2* 250кг */
     2590, 2925,    1230,   530, 440,   1760, null, 11.2,   1.16,   '1944-05-01'),
    (113, 'истребитель тип 1',  'Ki-43-3b Hayabusa (Oscar)',        0, 40, 1, /* 2* 20mm HO-5 */ /* 2* 250кг */
     2590, 2925,    1230,   530, 440,   1760, null, 11.2,   1.16,   '1945-06-01');


