
insert into aircraft_list
    (id, name_ru, name_en, class_id, type_id, crew, 
        mass, max_mass, engine_power, max_speed, cruise_speed,
        range, range_with_tank, ceiling, time_to_altitude, in_service)
    values
    (114, 'палубный штурмовик тип 13-1', /* 2MT2, 2MT3 */   'Mitsubishi B1M1 (2MT1)', 1, 41, 2, /* 2*2* 7.7mm */ /* 450мм торпеда || 2* 240кг бомбы */
     2697, 2697,    450,    210, 176,    370, null, 4.5,    null,   '1923-01-01'),
    (115, 'палубный штурмовик тип 13-2',                    'Mitsubishi B1M2 (3MT1)', 1, 41, 3, /* 2*2* 7.7mm */ /* 450мм торпеда || 2* 240кг бомбы */
     2697, 2697,    500,    210, 176,    370, null, 4.5,    null,   '1923-01-01'),
    (116, 'палубный штурмовик тип 13-3',                    'Mitsubishi B1M3 (3MT3)', 1, 41, 3, /* (1+2)* 7.7mm */ /* 450мм торпеда || 2* 240кг бомбы */
     2697, 2697,    600,    210, 176,    370, null, 4.5,    null,   '1929-01-01'),

    (123, 'торпедоносец тип 89-1',  'Mitsubishi B2M1', 1, 45, 3, /* 2* 7.7mm */ /* 800кг торпеда */
     3600, 3600,    650,    213, 184,   1780, null, 4.5,    null,   '1931-01-01'),
    (124, 'торпедоносец тип 89-2',  'Mitsubishi B2M2', 1, 45, 3, /* 2* 7.7mm */ /* 800кг торпеда */
     3600, 3600,    650,    213, 184,   1780, null, 4.5,    null,   '1934-01-01'),
    
    (70, 'торпедоносец тип 92',     'Yokosuka B3Y1',    1, 31, 3, /* 2* 7.7mm */ /* 800кг торпеда || 500кг бомб */
     3200, 3200,    600,    219, null,   900, null, null, null,     '1933-01-01'),

    (119, 'палубный штурмовик тип 96',      'Yokosuka B4Y1 (Jean)',     1, 43, 3, /* 7.7mm type 92 */ /* 800кг торпеда || 500кг бомб */
     2000, 3600,    840,    278, null,  1580, null, 6.0,    4.65,   '1936-11-01'),

    (7,  'торпедоносец тип 97',             'Nakajima B5N1 Kate',       1, 1, 3, /* 7.7mm type 92 */ /* 1 торпеда || 800кг || 2* 250кг || 6* 60кг */
     2800, 4100,     840,   378, 250,   1000, null, 8.26,   2.55,   '1937-01-01'),
    (8,  'торпедоносец тип 97',             'Nakajima B5N2 Kate',       1, 1, 3, /* 7.7mm type 92 */ /* 1 торпеда || 800кг || 2* 250кг || 6* 60кг */
     2800, 4100,    1000,   378, 259,    978, null, 8.26,   2.55,   '1939-01-01'),

    (38, 'торпедоносец B6N модель 11',          'Nakajima B6N1 Tenzan',     1, 10, 3, /* 2* 7.7mm type 92 */ /* 1 торпеда || 800кг || 2* 250кг */
     5200, 5650,    1870,   482, 333,   1746, null, 8.6,    2.19,   '1943-01-01'),
    (39, 'торпедоносец B6N модель 12',          'Nakajima B6N2 Tenzan',     1, 10, 3, /* 2* 7.7mm type 92 */ /* 1 торпеда || 800кг || 2* 250кг */ /* РЛС type 3 с осени 1943*/
     5200, 5650,    1850,   482, 333,   1746, null, 8.6,    2.19,   '1943-06-01'),
    (40, 'торпедоносец B6N модель 12a',         'Nakajima B6N2a Tenzan',    1, 10, 3, /* 7.7mm type 92, 12.7mm HO-103 */ /* 1 торпеда || 800кг || 2* 250кг */
     5200, 5650,    1850,   482, 333,   1746, null, 8.6,    2.19,   '1943-06-01'),

    (51, 'торпедоносец B7A Grace',  'Aichi B7A2 Ryusei',            1, 17, 2, /* 2* 20mm type 99, 13.2mm type 3 */ /* 1 торпеда || 800кг */
     5625, 6500,    1825,   567, null,  3038, null, 11.25,  1.73,   '1944-03-01'),

    (79, 'торпедоносец тип 96 модель 11',   'Mitsubishi G3M1 Nell',     1, 37, 5, /* 2* 7.7mm type 92 */ /* 1 торпеда || 800кг */
     4800, 7700,    1820,   350, 295,   2800, null,  7.5,   1.83,   '1936-06-01'),
    (80, 'торпедоносец тип 96 модель 11',   'Mitsubishi G3M1-L Nell',   1, 37, 5, /* 2* 7.7mm type 92 */ /* 1 торпеда || 800кг */
     4800, 7700,    2150,   350, 295,   2800, null,  7.5,   1.83,   '1937-01-01'),
    (81, 'торпедоносец тип 96 модель 21',   'Mitsubishi G3M2 Nell',     1, 37, 7, /* 1* 20mm type 99, 2* 7.7mm type 92 */ /* 1 торпеда || 800кг */
     5000, 7800,    2250,   370, 295,   4400, null,  9.0,   1.83,   '1937-01-01'),
    (82, 'торпедоносец тип 96 модель 21b',  'Mitsubishi G3M2b Nell',    1, 37, 5, /* 1* 20mm type 99, 2* 7.7mm type 92 */ /* 1 торпеда || 800кг */
     5000, 7800,    2250,   370, 295,   4400, null,  9.0,   1.83,   '1939-01-01'),
    (83, 'торпедоносец тип 96 модель 21c',  'Mitsubishi G3M2c Nell',    1, 37, 7, /* 1* 20mm type 99, 4* 7.7mm type 92 */ /* 1 торпеда || 800кг */
     5000, 7800,    2250,   370, 295,   4400, null,  9.0,   1.83,   '1939-01-01'),
    (84, 'торпедоносец тип 96 модель 22',   'Mitsubishi G3M2 Nell',     1, 37, 7, /* 1* 20mm type 99, 4* 7.7mm type 92 */ /* 1 торпеда || 800кг */
     5000, 7800,    2250,   370, 295,   4400, null,  9.0,   1.83,   '1940-09-01'),
    (85, 'торпедоносец тип 96 модель 23',   'Mitsubishi G3M3 Nell',     1, 37, 7, /* 1* 20mm type 99, 4* 7.7mm type 92 */ /* 1 торпеда || 800кг */
     5250, 8000,    2600,   415, 295,   6200, null, 10.3,   1.83,   '1942-06-01'),
    (86, 'высотный разведчик тип 96 модель 11', 'Mitsubishi G3M2-Kai',  2, 37, 5, /* 4* 7.7mm type 92 */
     5000, 7800,    2250,   370, 295,   4400, null,  9.0,   1.83,   '1941-02-01'),
    (87, 'торпедоносец тип 96 модель 23',   'Mitsubishi G3M3-Q Nell',   1, 37, 7, /* 1* 20mm type 99, 4* 7.7mm type 92 */ /* 800кг */
     5250, 8000,    2600,   415, 295,   6200, null, 10.3,   1.83,   '1944-07-01'), /* противолодочный */
    /* L3Y на базе G3M */
    (88, 'транспорт тип 96 модель 11',      'Yokosuka L3Y1',            9, 38, 5, /* 2* 7.7mm type 92 */
     4800, 7700,    1820,   350, 295,   2800, null,  7.5,   1.83,   '1935-01-01'),
    (89, 'транспорт тип 96 модель 12',      'Yokosuka L3Y2',            9, 38, 5, /* 2* 7.7mm type 92 */
     5000, 7800,    2250,   370, 295,   4400, null,  9.0,   1.83,   '1937-01-01'),

    (90,  'торпедоносец тип 1 модель 11',   'Mitsubishi G4M1',          1, 39, 7, /* 1* 20mm type 99-1, 5* 7.7mm type 92 */ /* 1 торпеда || 2200кг */
     9500, 12500,   3060,   428, 315,   6000, null,  9.1,   2.57,   '1941-04-02'),
    (91,  'торпедоносец тип 1 модель 11',   'Mitsubishi G4M1',          1, 39, 7, /* 1* 20mm type 99-1, 5* 7.7mm type 92 */ /* 1 торпеда || 2200кг */
     9500, 14000,   3060,   452, 322,   5400, null,  9.1,   2.57,   '1942-03-01'),
    (92,  'торпедоносец тип 1 модель 13',   'Mitsubishi G4M1',          1, 39, 7, /* 1* 20mm type 99-1, 5* 7.7mm type 92 */ /* 1 торпеда || 2200кг */
     9500, 14000,   3060,   452, 322,   5400, null,  9.1,   2.14,   '1942-03-01'),
    (93,  'торпедоносец тип 1 модель 13',   'Mitsubishi G4M1',          1, 39, 7, /* 1* 20mm type 99-1, 5* 7.7mm type 92 */ /* 1 торпеда || 2200кг */
     9500, 14000,   3060,   443, 322,   5100, null,  9.1,   2.14,   '1943-03-01'),
    (94,  'торпедоносец тип 1 модель 22',   'Mitsubishi G4M2',          1, 39, 7, /* 2* 20mm type 99-1, 4* 7.7mm type 92 */ /* 1 торпеда || 2200кг */
     12000, 15390,  3600,   437, 322,   3300, null,  9.1,   2.6,    '1943-07-01'),
    (95,  'торпедоносец тип 1 модель 22a',  'Mitsubishi G4M2',          1, 39, 9, /* 4* 20mm type 99-1, 2* 7.7mm type 92 */ /* 1 торпеда || 2200кг */ /* радар тип 3 H6 */
     12000, 15390,  3600,   437, 322,   3300, null,  9.1,   2.6,    '1943-07-01'),
    (96,  'торпедоносец тип 1 модель 22b',  'Mitsubishi G4M2',          1, 39, 9, /* 3* 20mm type 99-1, 20mm type 99-2, 2* 7.7mm type 92 */ /* 1 торпеда || 2200кг */
     12000, 15390,  3600,   437, 322,   3300, null,  9.1,   2.6,    '1943-07-01'),
    (97,  'торпедоносец тип 1 модель 24',   'Mitsubishi G4M2a',         1, 39, 7, /* 2* 20mm type 99-1, 4* 7.7mm type 92 */ /* 1 торпеда || 2200кг */
     12000, 15390,  3600,   450, 330,   4300, null,  9.1,   2.85,   '1943-07-01'),
    (98,  'торпедоносец тип 1 модель 24a',  'Mitsubishi G4M2a',         1, 39, 9, /* 4* 20mm type 99-1, 2* 7.7mm type 92 */ /* 1 торпеда || 2200кг */ /* радар тип 3 H6 */
     12000, 15390,  3600,   450, 330,   4300, null,  9.1,   2.85,   '1943-07-01'),
    (99,  'торпедоносец тип 1 модель 24b',  'Mitsubishi G4M2a',         1, 39, 9, /* 3* 20mm type 99-1, 20mm type 99-2, 2* 7.7mm type 92 */ /* 1 торпеда || 2200кг */
     12000, 15390,  3600,   450, 330,   4300, null,  9.1,   2.85,   '1943-07-01'),
    (100, 'торпедоносец тип 1 модель 24c',  'Mitsubishi G4M2a',         1, 39, 9, /* 3* 20mm type 99-1, 20mm type 99-2, 7.7mm type 92, 13.2mm type 2 */ /* 1 торпеда || 2200кг */
     12000, 15390,  3600,   450, 330,   4300, null,  9.1,   2.85,   '1943-07-01'),
    (101, 'торпедоносец тип 1 модель 24d',  'Mitsubishi G4M2a',         1, 39, 9, /* 2* 20mm type 99-1, 2* 7.7mm type 92 */ /* 2* Yokosuka MXY7 Okha (управляемый снаряд) */
     12000, 15390,  3600,   450, 330,   4300, null,  9.1,   2.85,   '1943-07-01'),
    (102, 'торпедоносец тип 1 модель 34a',  'Mitsubishi G4M3',          1, 39, 9, /* 4* 20mm type 99-1, 2* 7.7mm type 92 */ /* 1 торпеда || 2200кг */ /* радар тип 3 H6 */
     12500, 15390,  3700,   470, 350,   4300, null,  9.1,   2.85,   '1944-01-01'),
    (103, 'торпедоносец тип 1 модель 34b',  'Mitsubishi G4M3',          1, 39, 9, /* 3* 20mm type 99-1, 20mm type 99-2, 2* 7.7mm type 92 */ /* 1 торпеда || 2200кг */
     12500, 15390,  3700,   470, 350,   4300, null,  9.1,   2.85,   '1944-01-01'),
    (104, 'торпедоносец тип 1 модель 34b',  'Mitsubishi G4M3',          1, 39, 9, /* 3* 20mm type 99-1, 20mm type 99-2, 7.7mm type 92, 13.2mm type 2 */ /* 1 торпеда || 2200кг */
     12500, 15390,  3700,   470, 350,   4300, null,  9.1,   2.85,   '1944-01-01'),

    (134, 'армейский бомбардировщик тип 99', 'Kawasaki Ki-48 Lily',     4, 48, 4, /* 400кг */
      6500,  6750,  2260,   503, 390,   2400, null, 10.1,   1.69,   '1940-01-01'),
    (135, 'армейский бомбардировщик тип 99', 'Kawasaki Ki-48-1a Lily',  4, 48, 4, /* 3* 7.7mm */ /* 400кг */
      6500,  6750,  2260,   503, 390,   2400, null, 10.1,   1.69,   '1940-07-01'),
    (136, 'армейский бомбардировщик тип 99', 'Kawasaki Ki-48-1b Lily',  4, 48, 4, /* 3* 7.7mm */ /* 400кг */
      6500,  6750,  2260,   503, 390,   2400, null, 10.1,   1.69,   '1941-01-01'),
    (137, 'армейский бомбардировщик тип 99', 'Kawasaki Ki-48-2a Lily',  4, 48, 4, /* 3* 7.7mm */ /* 800кг */
      6500,  6750,  2260,   503, 390,   2400, null, 10.1,   1.69,   '1942-01-01'),
    (138, 'армейский бомбардировщик тип 99', 'Kawasaki Ki-48-2b Lily',  4, 48, 4, /* 3* 7.7mm */ /* 800кг */
      6500,  6750,  2260,   503, 390,   2400, null, 10.1,   1.69,   '1943-01-01'),
    (139, 'армейский бомбардировщик тип 99', 'Kawasaki Ki-48-2c Lily',  4, 48, 4, /* 1* 12.7 type 1, 2* 7.7mm */ /* 800кг */
      6500,  6750,  2260,   503, 390,   2400, null, 10.1,   1.69,   '1942-01-01');

