
insert into aircraft_list
    (id, name_ru, name_en, class_id, type_id, crew, 
        mass, max_mass, engine_power, max_speed, cruise_speed,
        range, range_with_tank, ceiling, time_to_altitude, in_service)
    values
    (45, 'пикировщик тип 94',   'Aichi D1A1 Susie',                 3, 14, 2, /* 3* 7.7mm type 92 */ /* 250кг, 2* 30кг */
     2500, 2610,     730,   309, 222,    926, null, 6.98,   2.61,   '1934-01-01'),
    (46, 'пикировщик тип 96',   'Aichi D1A2 Susie',                 3, 14, 2, /* 3* 7.7mm type 92 */ /* 250кг, 2* 30кг */
     2500, 2610,     820,   309, 222,    926, null, 6.98,   2.59,   '1936-01-01'),

    (9,  'пикировщик тип 99 модель 11',     'Aichi D3A1 Val',           3, 2, 2, /* 2* 7.7mm type 97, 7.7mm type 92 (rear) */ /* 250кг || 2* 60кг */
     2400, 3900,    1000,   386, 296,   1630, 1820, 9.3,    2.15,   '1940-01-01'), 
    (10, 'пикировщик тип 99 модель 22',     'Aichi D3A2 Val',           3, 2, 2, /* 2* 7.7mm type 97, 7.7mm type 92 (rear) */ /* 250кг || 2* 60кг */
     2570, 4100,    1300,   430, 296,   1560, 2380, 10.5,   1.94,   '1942-06-01'),

    (17, 'разведчик тип 2 модель 11',   'Yokosuka D4Y1-C Suisei (Judy)',    2, 5, 2, /* 3* 7.7mm type 97 */
     2500, 4000,    1200,   550, 426,   1800, 2200, 10.7,   1.61,   '1942-01-01'),
    (18, 'пикировщик тип 2 модель 11',  'Yokosuka D4Y1 Suisei (Judy)',      3, 5, 2, /* 3* 7.7mm type 97 */ /* 500кг */
     2500, 4000,    1200,   550, 426,   1800, 2200, 10.7,   1.61,   '1943-07-01'),
    (19, 'пикировщик тип 2 модель 21',  'Yokosuka D4Y1 KAI Suisei (Judy)',  3, 5, 2, /* 3* 7.7mm type 97 */ /* 500кг */
     2500, 4000,    1200,   550, 426,   1800, 2200, 10.7,   1.61,   '1944-03-17'), /* Исе Хюга */
    (20, 'пикировщик тип 2 модель 12',  'Yokosuka D4Y2 Suisei (Judy)',      3, 5, 2, /* 3* 7.7mm type 97 */ /* 500кг */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-05-01'),
    (21, 'пикировщик тип 2 модель 12a', 'Yokosuka D4Y2a Suisei (Judy)',     3, 5, 2, /* 2* 7.7mm type 97, 13.2mm type 3 (rear) */ /* 500кг */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-10-01'),
    (22, 'истребитель тип 2 модель 12e','Yokosuka D4Y2-S Suisei (Judy)',    0, 5, 2, /* 2* 7.7mm type 97, 13.2mm type 3 (rear), 20mm type 99 */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-10-01'),
    (23, 'пикировщик тип 2 модель 22',  'Yokosuka D4Y2 KAI Suisei (Judy)',  3, 5, 2, /* 3* 7.7mm type 97 */ /* 500кг */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-10-01'), /* Исе Хюга */
    (24, 'пикировщик тип 2 модель 22a', 'Yokosuka D4Y2a KAI Suisei (Judy)', 3, 5, 2, /* 2* 7.7mm type 97, 13.2mm type 3 (rear) */ /* 500кг */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-11-01'), /* Исе Хюга */
    (25, 'разведчик тип 2 модель 12',   'Yokosuka D4Y2-R Suisei (Judy)',    2, 5, 2, /* 3* 7.7mm type 97 */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-05-01'),
    (26, 'разведчик тип 2 модель 12a',  'Yokosuka D4Y2a-R Suisei (Judy)',   2, 5, 2, /* 3* 7.7mm type 97, 13.2mm type 3 (rear) */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-10-01'),
    (27, 'пикировщик тип 2 модель 33',  'Yokosuka D4Y3 Suisei (Judy)',      3, 5, 2, /* 3* 7.7mm type 97 */ /* 500кг */
     2500, 4700,    1560,   580, 426,   1500, 2275, 10.7,   1.19,   '1944-08-01'),
    (28, 'истребитель тип 2 модель 33e','Yokosuka D4Y3-S Suisei (Judy)',    0, 5, 2, /* 2* 7.7mm type 97, 13.2mm type 3 (rear), 20mm type 99 */
     2500, 4700,    1560,   580, 426,   1500, 2275, 10.7,   1.19,   '1944-11-01'),
    (29, 'пикировщик тип 2 модель 43',  'Yokosuka D4Y4 Suisei (Judy)',      3, 5, 2, /* 2* 7.7mm type 97, 13.2mm type 3 (rear) */ /* 800кг */
     2500, 4700,    1560,   580, 426,   1500, 2275, 10.7,   1.19,   '1945-02-01');


