
insert into aircraft_list
    (id, name_ru, name_en, class_id, type_id, crew, 
        mass, max_mass, engine_power, max_speed, cruise_speed,
        range, range_with_tank, ceiling, time_to_altitude, in_service)
    values
    (73, 'гидросамолет Йокошо', 'Yokosuka Ro-go Ko-gata',       6, 33, 2, /* 7.7mm */ 
     1628, 1628,    220,    156, null,  780,  null,  null,  8.0,    '1918-01-01'), /* Нагато [III.1925 I.1926] испытания */

    (66,  'гидросамолет разведчик W.33',    'Hansa Brandenburg W.33',   6, 27, 2, /* 2+1* 7.92mm */
     2050, 2050,    210,    173, 158,   600,  null,  4.8,   6.3,    '1921-06-01'), /* Конго [1922, 1927]  Нагато [1926, ] */

    (78, 'гидросамолет разедчик тип 2',     'HD-26',            6, 36, 1, /* 1* 7.7mm */
     1500, 1500,    420,    132, null,  null, null, null,   2.5,    '1926-01-01'),

    (71, 'гидросамолет разведчик тип 14-1', 'Yokosuka E1Y1',    6, 32, 2, /* 7.7mm */ /* 2* 100кг бомб */
     2750, 2750,    400,    178, 130,   1156, null, 4,      9.4,    '1926-01-01'),
    (72, 'гидросамолет разведчик тип 14-2', 'Yokosuka E1Y2',    6, 32, 3, /* 7.7mm */ /* 2* 100кг бомб */
     2750, 2750,    451,    178, 130,   1156, null, 4,      9.4,    '1926-01-01'), /* Юра [1926-1927]  Абукума [1926-1927] */
    (76, 'гидросамолет разведчик тип 14-3', 'Yokosuka E1Y3',    6, 32, 3, /* 7.7mm */ /* 2* 100кг бомб */
     2750, 2750,    451,    178, 130,   1156, null, 4,      9.4,    '1931-01-01'), /* Конго [1931 ] */

    (67,  'гидросамолет разведчик тип 15',  'Nakajima E2N1',    6, 28, 2, /* 7.7mm type 92 */
     1950, 1950,    300,    172, 138,   640,  null,  5.4,  10.5,    '1927-01-01'), /* Конго [1927, ] */

    (77, 'гидросамолет разведчик тип 90-2-1',   'Nakajima E4N1',    6, 11, 2, /* 2* 7.7mm Vickers */
     1800, 1800,     585,   228, 146,   1000, null, 5.7,    5.86,   '1931-01-01'),
    (41, 'гидросамолет разведчик тип 90-2-2',   'Nakajima E4N2',    6, 11, 2, /* 2* 7.7mm Vickers */
     1800, 1800,     585,   228, 146,   1000, null, 5.7,    5.86,   '1931-01-01'),
    (42, 'гидросамолет разведчик тип 90-2-3',   'Nakajima E4N3',    6, 11, 2, /* 2* 7.7mm type 92 */ /* 2* 30кг */
     1800, 1800,     585,   228, 146,   1000, null, 5.7,    5.86,   '1933-01-01'),

    (57, 'гидросамолет разведчик тип 91',   'Yokosuka E6Y1',        6, 21, 2, /* none */
      750,  760,     160,   186, 138,    600, null, 4.8,    6.7,    '1933-01-01'),

    (30, 'гидросамолет разведчик тип 94 модель 1',  'Kawanishi E7K1 Alf',   6, 6, 3, /* 2* 7.7mm type 92 */
     2100, 3300,     520,   276, 185,   2463, null, 7,      3,      '1934-06-01'),
    (31, 'гидросамолет разведчик тип 94 модель 2',  'Kawanishi E7K2 Alf',   6, 6, 3, /* 2* 7.7mm type 92, 7.7mm type 97*/ /* 2* 60кг */
     2100, 3300,     850,   276, 185,   2463, null, 7,      3,      '1938-08-01'),

    (32, 'гидросамолет разведчик тип 95 модель 1',  'Nakajima E8N1 Dave',   6, 7, 2, /* 7.7mm type 97, 7.7mm type 92 */
     1320, 1900,     585,   301, 186,    898, null, 7.2,    2.17,   '1935-10-01'),
    (33, 'гидросамолет разведчик тип 95 модель 2',  'Nakajima E8N2 Dave',   6, 7, 2, /* 7.7mm type 97, 7.7mm type 92 */ /* 2* 30кг */
     1320, 1900,     630,   301, 186,    898, null, 7.2,    2.17,   '1938-01-01'),

    (74, 'гидросамолет разведчик тип 96',   'Watanabe E9W1',    6, 34, 2, /* 7.7mm */
     1253, 1253,    300,    232, 148,   731, null,  6.7,    null,   '1938-01-01'), /* подводные лодки */

    (43, 'гидросамолет разведчик тип 96',       'Aichi E10A Hank',  6, 12, 3, /* 7.7mm type 87 */
     3300, 3300,     500,   206, 106,   1852, null, 4.1,    5.9,    '1936-01-01'),

    (44, 'гидросамолет разведчик тип 98',       'Aichi E11A Laura', 6, 13, 3, /* 7.7mm type 92 */
     3297, 3297,     620,   217, 135,   1945, null, 4.4,    6.0,    '1938-01-01'),

    (11, 'гидросамолет разведчик тип 0',    'Aichi E13A Jake',          6, 3, 3, /* 7.7mm type 92 */ /* 250кг */
     3640, 4000,    1080,   375, 220,   2090, null, 8.73,   2.03,   '1940-12-01'),

    (64, 'гидросамолет разведчик тип 0',    'Yokosuka E14Y',        6, 25, 2, /* 7.7mm type 92 */ /* 2* 76кг */
     1500, 1600,     340,   250, 160,    900, null, 5.5,    3.33,   '1941-01-01'),

    (63, 'гидросамолет разведчик тип 2 модель 11',  'Kawanishi E15K1 Shiun (Norm)',  6, 24, 2, /* 7.7mm type 92 */
     4100, 4900,    1850,   460, 290,   3320, null, 9.8,    1.66,   '1942-10-01'),

    (140, 'гидросамолет разведчик тип 16',              'Aichi E16A1 Zuiun (Paul)',  6, 49, 2, /* 2* 7.7mm type 97  7.7mm type 92 */
     3900, 4553,    1300,   448, 333,   2400, null, 10.2,   1.53,   '1943-08-01'),
    (141, 'гидросамолет разведчик тип 16 модель 11',    'Aichi E16A1 Zuiun (Paul)',  6, 49, 2, /* 2* 20mm type 99-2  13.2mm type 2 */ /* 250кг */
     3900, 4553,    1300,   448, 333,   2400, null, 10.2,   1.53,   '1943-08-01'),
    (142, 'гидросамолет разведчик тип 16 модель 12',    'Aichi E16A2 Zuiun (Paul)',  6, 49, 2, /* 2* 20mm type 99-2  13.2mm type 2 */ /* 250кг */
     3900, 4553,    1560,   448, 352,   2400, null, 10.2,   1.53,   '1944-01-01');

