
insert into aircraft_list
    (id, name_ru, name_en, class_id, type_id, crew, 
        mass, max_mass, engine_power, max_speed, cruise_speed,
        range, range_with_tank, ceiling, time_to_altitude, in_service)
    values
    (75, 'летающая лодка тип 91',           'Hiro H4H',         7, 35, 6, /* 3* 7.7mm */ /* 2* 250кг */
     7500, 7500,   1600,    233, null,  1260, null, 3.6,    null,   '1933-01-01'),

    (34, 'летающая лодка тип 97 модель 11',         'Kawanishi H6K2 Mavis', 7, 8, 9, /* 20mm type 99, 4* 7.7mm type 97 */ /* 2 торпеды || 1000кг бомб */
     17000, 21500,  4000,   340, 222,   4797, null, 9.6,    2.68,   '1938-01-01'),
    (35, 'летающая лодка тип 97 модель 22',         'Kawanishi H6K4 Mavis', 7, 8, 9, /* 20mm type 99, 4* 7.7mm type 97 */ /* 2 торпеды || 1000кг бомб */
     17000, 21500,  3720,   340, 222,   6600, null, 9.6,    2.68,   '1940-01-01'),
    (36, 'летающая лодка тип 97 модель 23',         'Kawanishi H6K5 Mavis', 7, 8, 9, /* 20mm type 99, 4* 7.7mm type 97 */ /* 2 торпеды || 1000кг бомб */
     17000, 21500,  5200,   340, 222,   6600, null, 9.6,    2.68,   '1941-01-01'),

    (37, 'гидросамолет патрульный тип 0 модель 11', 'Mitsubishi F1M2 Pete', 6, 9, 2, /* 3* 7.7mm type 97, 7.7mm type 92 */ /* 2* 60кг || 250кг камикадзе */
     2550, 2856,     875,   365, 287,    730, null, 9.4,    1.94,   '1940-01-01'),

    (65, 'гидросамолет торпедоносец M6A',   'Aichi M6A1 Seiran',    8, 26, 1, /* 12.7mm HO-103 */ /* 1 торпеда || 850кг || 2* 250кг */
     4040, 4445,    1400,   474, 296,   1188, null, 9.9,    1.93,   '1945-01-01');


