    
/* силовая установка */
insert into external_burn_list
    (id, mass, max_power, in_service)
    values
    (0,  null, 152000,  null), /* Могами, Микума */
    (1,  null, 152000,  null), /* Судзуя, Кумано, тип Тоне, тип Сорю */
    (2,  null, 132000,  null), /* тип Такао */
    (3,  null, 132000,  null), /* тип Такао */
    (4,  null, 132000,  null), /* тип Меко */
    (5,  null, 102000,  null); /* тип Аоба, тип Фурутака */
    
insert into external_burn_boiling
    (object_id, item_id, count)
    values
    /* тип Могами, тип Тоне, тип Сорю */
    (0, 0,  8),
    (0, 1,  2),
    (1, 2,  8),
    
    /* тип Такао */
    (2, 3, 12),
    (2, 4,  2),
    (3, 3, 12),
    (3, 4,  2),
    
    /* тип Меко */
    (4, 3, 12),
    
    /* тип Аоба, тип Фурутака */
    (5, 5,  2),
    (5, 6,  8),
    (5, 7,  2);

insert into external_burn_machines
    (object_id, item_id, count)
    values
    /* Могами, Микума */
    (0,  0, 4),
    (0,  1, 4),
    (0,  2, 4),
    (0,  3, 4),
    (0,  4, 4),
    
    /* Судзуя, Кумано, тип Тоне, тип Сорю */
    (1,  0, 4),
    (1,  1, 4),
    (1,  2, 4),
    (1,  3, 4),
    (1,  4, 4),
    
    /* тип Такао */
    (2,  5, 4),
    (2,  6, 2),
    (2,  7, 2),
    (2,  8, 4),
    (2,  9, 4),
    (2, 10, 2),
    (2, 11, 8),
    (2, 12, 2),
    
    /* тип Такао, демонтировали индукцмонные турбины */
    (3,  5, 4),
    (3,  6, 2),
    (3,  7, 2),
    (3,  8, 4),
    (3,  9, 4),
    (3, 10, 2),
    (3, 11, 8),
    
    /* тип Меко */
    (4,  5, 4),
    (4,  6, 2),
    (4,  7, 2),
    (4,  8, 4),
    (4,  9, 4),
    (4, 10, 2),
    (4, 11, 8),
    
    /* тип Аоба, тип Фурутака */
    (5, 13, 4),
    (5, 14, 4),
    (5, 15, 2),
    (5, 16, 4);
  
    
    
insert into ship_propulsion
    (ship_id, propulsion_id, amount, date_from, date_to)
    values
    /* тип Тоне */
    (54, 1, 1,  '1938-11-20', '1945-07-24'),
    (55, 1, 1,  '1939-05-20', '1944-10-25'),
    
    /* тип Могами */
    (50, 0, 1,  '1935-07-28', '1944-10-25'),
    (51, 0, 1,  '1935-08-29', '1942-06-06'),
    (52, 1, 1,  '1937-10-31', '1944-10-25'),
    (53, 1, 1,  '1937-10-31', '1944-11-25'),
    
    /* тип Такао */
    (40, 2, 1,  '1932-05-31', '1938-05-01'),
    (40, 3, 1,  '1939-08-21',  null),
    (41, 2, 1,  '1932-03-30', '1939-03-20'),
    (41, 3, 1,  '1939-10-30', '1944-10-23'),
    (42, 2, 1,  '1932-06-20', '1944-10-23'),
    (43, 2, 1,  '1932-06-30', '1944-10-25'),
    
    /* тип Меко */
    (46, 4, 1,  '1929-07-31',  null),
    (47, 4, 1,  '1928-11-26', '1944-11-05'),
    (48, 4, 1,  '1929-08-20', '1945-06-08'),
    (49, 4, 1,  '1929-04-25', '1945-05-16'),
    
    /* тип Аоба */
    (44, 5, 1,  '1927-09-20', '1945-07-28'),
    (45, 5, 1,  '1927-09-30', '1942-11-13'),
    
    /* тип Фурутака */
    (38, 5, 1,  '1926-03-31', '1942-10-12'),
    (39, 5, 1,  '1926-07-20', '1942-08-10');


