
/* турбины */
insert into steam_turbine
    (id, name_ru, name_en, in_service, rpm, power, stages)
    values
    (0,  'Кампон высокого давления',                'Kampon high pressure',              null,  2613,   12410, 4), /* 4* тип Могами */
    (1,  'Кампон среднего давления',                'Kampon intermediate pressure',      null,  2613,   12340, 4), /* 4* тип Могами */
    (2,  'Кампон низкого давления',                 'Kampon low pressure',               null,  2291,   13250, 4), /* 4* тип Могами */

    (5,  'Кампон высокого давления (внутренние)',   'Kampon high pressure (inner)',      null,  2899,    8125, 6), /* 4* тип Такао, тип Меко */
    (6,  'Кампон высокого давления (внешние)',      'Kampon high pressure (outer)',      null,  3017,    8125, 6), /* 2* тип Такао, тип Меко */
    (7,  'Кампон обычная высокого давления',        'Kampon ordinary use high pressure', null,  3017,    8125, 5), /* 2* тип Такао, тип Меко */
    (8,  'Кампон низкого давления (внутренние)',    'Kampon low pressure (inner)',       null,  2054,    8125, 6), /* 4* тип Такао, тип Меко */
    (9,  'Кампон низкого давления (внешние)',       'Kampon low pressure (outer)',       null,  1997,    8125, 6), /* 4* тип Такао, тип Меко */
    (12, 'Кампон индукционная',                     'Kampon induction',                  null,  null,    null, null), /* 2* тип Такао */ /* для быстрого перевода с крейсерского (2 винта) на полный (4 винта) ход */
    
    (13, 'Кампон высокого давления',                'Kampon high pressure',              null,  3000,   12500, 6), /* 4* тип Аоба, тип Фурутака */
    (14, 'Кампон низкого давления',                 'Kampon low pressure',               null,  2000,   13000, 9); /* 4* тип Аоба, тип Фурутака */
    
    
/* турбины крейсерского хода */
insert into steam_turbine_cruise
    (id, name_ru, name_en, in_service, rpm, power, stages)
    values
    (3,  'Кампон',  'Kampon',    null,  4796,   2770, 8), /* 4* тип Могами */
    (10, 'Кампон',  'Kampon',    null,  5439,   3100, 3), /* 2* тип Такао, тип Меко */
    (15, 'Кампон',  'Kampon',    null,  null,   null, 3); /* 2* тип Аоба, тип Фурутака */
    
    
/* турбины заднего хода */
insert into steam_turbine_reverse
    (id, name_ru, name_en, in_service, rpm, power, stages)
    values
    (4,  'Кампон',  'Kampon',    null,  1481,   10000, 1), /* 4* тип Могами */
    (11, 'Кампон',  'Kampon',    null,  1140,    4500, 1), /* 8* тип Такао, тип Меко */
    (16, 'Кампон',  'Kampon',    null,  null,    7000, 1); /* 4* тип Аоба, тип Фурутака */
    
    
    
/* котлы */
insert into boiling_types
    (id, name_ru, name_en, value, temperature, pressure, heating_surface)
    values
    (0,  'Кампон Ро Го',            'Kampon Ro Go large',   2,  300,    22,  917), /* 8* Могами, Микума */
    (1,  'Кампон Ро Го малый',      'Kampon Ro Go small',   2,  300,    22,  757), /* 2* Могами, Микума */
    (2,  'Кампон Ро Го',            'Kampon Ro Go large',   2,  300,    22, 1107), /* 8* Судзуя, Кумано */
    
    (3,  'Кампон Ро Го',            'Kampon Ro Go',         2,  100,    20,  970), /* 12* тип Такао, тип Меко */
    (4,  'Кампон Ро Го',            'Kampon Ro Go donkey',  2,  100,    14,   61), /*  2* тип Такао */
    
    (5,  'Кампон Ро Го большой',    'Kampon Ro Go large',   2,  156,  18.3, null), /* 2* тип Аоба, тип Фурутака */
    (6,  'Кампон Ро Го средний',    'Kampon Ro Go medium',  2,  156,  18.3, null), /* 8* тип Аоба, тип Фурутака */
    (7,  'Кампон Ро Го малый',      'Kampon Ro Go small',   3,  156,  18.3, null); /* 2* тип Аоба, тип Фурутака */
    
    
    
/* силовая установка */
insert into external_burn_list
    (id, mass, max_power, in_service)
    values
    (0,  null, 152000,  null), /* Могами, Микума */
    (1,  null, 152000,  null), /* Судзуя, Кумано */
    (2,  null, 132000,  null), /* тип Такао */
    (3,  null, 132000,  null), /* тип Такао */
    (4,  null, 132000,  null), /* тип Меко */
    (5,  null, 102000,  null); /* тип Аоба, тип Фурутака */
    
insert into external_burn_boiling
    (object_id, item_id, count)
    values
    /* тип Могами */
    (0, 0,  8),
    (0, 1,  2),
    (1, 2,  8),
    
    /* тип Такао */
    (2, 3, 12),
    (2, 4,  2),
    (3, 3, 12),
    (3, 4,  2),
    
    /* тип Меко */
    (4, 3, 12),
    
    /* тип Аоба, тип Фурутака */
    (5, 5,  2),
    (5, 6,  8),
    (5, 7,  2);

insert into external_burn_machines
    (object_id, item_id, count)
    values
    /* Могами, Микума */
    (0,  0, 4),
    (0,  1, 4),
    (0,  2, 4),
    (0,  3, 4),
    (0,  4, 4),
    
    /* Судзуя, Кумано */
    (1,  0, 4),
    (1,  1, 4),
    (1,  2, 4),
    (1,  3, 4),
    (1,  4, 4),
    
    /* тип Такао */
    (2,  5, 4),
    (2,  6, 2),
    (2,  7, 2),
    (2,  8, 4),
    (2,  9, 4),
    (2, 10, 2),
    (2, 11, 8),
    (2, 12, 2),
    
    /* тип Такао, демонтировали индукцмонные турбины */
    (3,  5, 4),
    (3,  6, 2),
    (3,  7, 2),
    (3,  8, 4),
    (3,  9, 4),
    (3, 10, 2),
    (3, 11, 8),
    
    /* тип Меко */
    (4,  5, 4),
    (4,  6, 2),
    (4,  7, 2),
    (4,  8, 4),
    (4,  9, 4),
    (4, 10, 2),
    (4, 11, 8),
    
    /* тип Аоба, тип Фурутака */
    (5, 13, 4),
    (5, 14, 4),
    (5, 15, 2),
    (5, 16, 4);
  
    
    
insert into ship_propulsion
    (ship_id, propulsion_id, amount, date_from, date_to)
    values
    /* тип Тоне */
    (54, 1, 1,  '1938-11-20', '1945-07-24'),
    (55, 1, 1,  '1939-05-20', '1944-10-25'),
    
    /* тип Могами */
    (50, 0, 1,  '1935-07-28', '1944-10-25'),
    (51, 0, 1,  '1935-08-29', '1942-06-06'),
    (52, 1, 1,  '1937-10-31', '1944-10-25'),
    (53, 1, 1,  '1937-10-31', '1944-11-25'),
    
    /* тип Такао */
    (40, 2, 1,  '1932-05-31', '1938-05-01'),
    (40, 3, 1,  '1939-08-21',  null),
    (41, 2, 1,  '1932-03-30', '1939-03-20'),
    (41, 3, 1,  '1939-10-30', '1944-10-23'),
    (42, 2, 1,  '1932-06-20', '1944-10-23'),
    (43, 2, 1,  '1932-06-30', '1944-10-25'),
    
    /* тип Меко */
    (46, 4, 1,  '1929-07-31',  null),
    (47, 4, 1,  '1928-11-26', '1944-11-05'),
    (48, 4, 1,  '1929-08-20', '1945-06-08'),
    (49, 4, 1,  '1929-04-25', '1945-05-16'),
    
    /* тип Аоба */
    (44, 5, 1,  '1927-09-20', '1945-07-28'),
    (45, 5, 1,  '1927-09-30', '1942-11-13'),
    
    /* тип Фурутака */
    (38, 5, 1,  '1926-03-31', '1942-10-12'),
    (39, 5, 1,  '1926-07-20', '1942-08-10');


