
/*
    32 - Юбари
*/


/* характеристики */
insert into general
    (ship_id, date_from, date_to, 
     displacement_standart, displacement_full, 
     length, width, draft,
     crew, speed_max, speed_cruise, range)
    values
    (32, '1923-07-31', '1943-08-01',    3387, 4075,     138.9, 12.4, 4.2,   328, 34.8, 14, 7800),
    (32, '1943-10-16', '1944-04-28',    3410, 4220,     138.9, 12.4, 4.2,   395, 34.2, 14, 7800);

    
    
/* модернизации */
insert into ship_event_list
    (class_id, ship_id, date_from, date_to, description)
    values
    (6, 32, '1924-12-01', '1925-02-24', 'Сасебо, в резерве'),
    (1, 32, '1925-01-02', '1925-02-24', 'Сасебо, увеличение высоты дымовой трубы'),
    (7, 32, '1927-12-01', '1932-01-03', 'в резерве'),
    (1, 32, '1931-09-04', '1932-01-23', 'Куре'), /* по другим данным в Сасебо */
    (0, 32, '1932-03-22', '1933-01-31', 'Сасебо, установка щитов для торпедных аппаратов'),
    (7, 32, '1933-11-15', '1934-11-15', 'в резерве'),
    (1, 32, '1934-05-17', '1934-07-20', 'Сасебо, демонтаж минных рельс, добавление балласта (200т)'),
    (0, 32, '1935-07-09', '1935-11-15', 'Йокосука'),
    (6, 32, '1938-01-14', '1940-11-15', 'Йокосука'),
    (1, 32, '1938-01-14', '1938-03-31', 'Йокосука'),
    (1, 32, '1941-04-20', '1941-05-01', 'Йокосука'),
    (5, 32, '1941-12-10', '1941-12-12', 'Уэйк'),
    (5, 32, '1941-12-21', '1941-12-23', 'Уэйк'),
    (0, 32, '1942-01-03', '1942-01-15', 'Трук'), /* неточная дата окончания */
    (7, 32, '1942-03-10', '1942-03-10', 'атакован самолетами с CV-5 Yorktown'),
    (1, 32, '1942-03-25', '1942-04-10', 'Трук, после повреждений'),
    (1, 32, '1942-05-23', '1942-06-16', 'Йокосука'),
    (1, 32, '1942-12-10', '1943-03-22', 'Йокосука'),
    (7, 32, '1943-07-05', '1943-07-05', 'подорвался на мине (авиационная Mk 12 сброшенная TBF-1 Avenger)'),
    (0, 32, '1943-08-01', '1943-10-16', 'Йокосука'),
    (0, 32, '1943-12-19', '1944-03-04', 'Йокосука');
    
    
    
/* орудия ГК */
insert into ship_guns
    (ship_id, mount_id, amount, date_from, date_to)
    values
    (32, 18, 2, '1923-07-31', '1943-08-01'),
    (32, 18, 1, '1943-10-16', '1943-12-19'),
    (32, 19, 2, '1923-07-31', '1944-04-28');

 
    
/* ПВО */
insert into ship_guns
    (ship_id, mount_id, amount, date_from, date_to)
    values
    (32, 55,  1, '1923-07-31', '1932-03-22'),
    (32, 51,  2, '1935-11-15', '1943-12-19'),
    (32, 44,  2, '1938-03-31', '1942-12-10'),
    (32, 52,  2, '1942-01-15', '1942-12-10'),
    (32, 44,  4, '1943-03-22', '1944-04-28'),
    (32, 45,  1, '1943-10-16', '1943-12-19'),
    (32, 45,  3, '1944-03-04', '1944-04-28'),
    (32, 43,  8, '1944-03-04', '1944-04-28'),
    (32,  9,  1, '1944-03-04', '1944-04-28'),
    (32, 52,  2, '1944-03-04', '1944-04-28');
 
    
    
/*
    2 сигнальные 50мм Ямаучи с 15.11.1935 по 03.01.1942
    гидрофон тип 93 с 16.10.1943
    сонар тип 93 мод 4 с 16.10.1943
*/
    
    
    
/* торпедные аппараты */
insert into ship_torpedo_tubes
    (ship_id, tube_id, amount, date_from, date_to)
    values
    (32,  6, 2, '1923-07-31', '1944-04-28');



/* радары */
insert into ship_searchers
    (ship_id, searcher_id, amount, date_from, date_to)
    values
    (32, 26, 1, '1944-03-04', '1944-04-28'), /* E27 */ /* по данным c 22.03.1943 но он еще в разработке */
    (32,  1, 1, '1943-10-16', '1944-04-28'); /* тип 22 */

 
    
/* прожектора */
insert into ship_searchers
    (ship_id, searcher_id, amount, date_from, date_to)
    values
    (32, 36, 2, '1923-07-31', '1943-08-01'),
    (32, 36, 1, '1943-10-16', '1944-04-28');
        
        
        
/* бомбосбрасыватели */
insert into ship_throwers
    (ship_id, throwers_id, amount, date_from, date_to)
    values
    (32, 2, 2, '1944-03-04', '1944-04-28');


