
insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (443, 5, 85, 'RO-60',   null, '1923-09-17', '1941-12-29', 'Атолл Кваджалейн'),
    (444, 5, 85, 'RO-61',   null, '1924-02-09', '1942-08-31', 'DD-369 Reid, Алеутские острова'),
    (445, 5, 85, 'RO-62',   null, '1924-07-24',  null,         null),
    (446, 5, 85, 'RO-63',   null, '1924-12-20',  null,         null),
    (447, 5, 85, 'RO-64',   null, '1925-04-30', '1945-04-12', 'Хиросимский залив'),
    (448, 5, 85, 'RO-65',   null, '1926-06-30', '1942-11-04', 'Алеутские острова'),
    (449, 5, 85, 'RO-66',   null, '1927-07-28', '1941-12-17', 'Уэйк'),
    (450, 5, 85, 'RO-67',   null, '1926-12-15',  null,         null),
    (451, 5, 85, 'RO-68',   null, '1925-10-29',  null,         null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (452, 5, 86, 'RO-35',   null, '1943-03-31', '1943-08-25', 'DD-392 Patterson, Новые Гебриды'),
    (453, 5, 86, 'RO-36',   null, '1943-05-27', '1944-06-13', 'DD-680 Melvin, Сайпан 15°21'' с.ш. 147°00'' в.д.'),
    (454, 5, 86, 'RO-37',   null, '1943-06-30', '1944-04-22', 'DD-484 Buchanan, Соломоновы острова 11°47'' ю.ш. 164°17'' в.д.'),
    (455, 5, 86, 'RO-38',   null, '1943-07-24', '1943-11-24', 'DD-669 Cotten'),
    (456, 5, 86, 'RO-39',   null, '1943-09-12', '1944-02-02', 'DD-517 Walker, атолл Вотье 09°24'' с.ш. 170°32'' в.д.'),
    (457, 5, 86, 'RO-40',   null, '1943-09-28', '1944-02-16', 'DD-360 Phelps, атолл Кваджалейн 09°50'' с.ш. 166°35'' в.д.'),
    (458, 5, 86, 'RO-41',   null, '1943-11-26', '1945-03-23', 'DD-555 Haggard, у Окинавы 22°57'' с.ш. 132°19'' в.д.'),
    (459, 5, 86, 'RO-42',   null, '1943-08-31', '1944-06-11', 'DE-739 Bangust, атолл Кваджалейн 10°05'' с.ш. 168°22'' в.д.'),
    (460, 5, 86, 'RO-43',   null, '1943-12-16', '1945-02-26', 'TBM Avenger авиагруппы CVE-57 Anzio, у Иводзимы 24°07'' с.ш. 140°19'' в.д.'),
    (461, 5, 86, 'RO-44',   null, '1943-09-13', '1944-06-16', 'DE-19 Burden R. Hastings, атолл Эниветок, 11°13'' с.ш. 164°15'' в.д.'),
    (462, 5, 86, 'RO-45',   null, '1944-01-11', '1944-04-30', 'CVL-26 Monterey, DD-351 MacDonough, DD-538 Stephen Potter, Чуук 06°13'' с.ш. 151°19'' в.д.'),
    (463, 5, 86, 'RO-46',   null, '1944-02-11', '1945-04-18', 'SS-405 Seaowl, CVE-72 Tulagi, Уэйк 24°15'' с.ш. 131°16'' в.д.'),
    (464, 5, 86, 'RO-47',   null, '1944-01-31', '1944-05-27', 'DE-440 McCoy Reynolds, Каролинские острова 09°19'' с.ш. 136°44'' в.д.'),
    (465, 5, 86, 'RO-48',   null, '1944-03-31', '1944-07-14', 'DE-259 William C. Miller, Сайпан 13°01'' с.ш. 151°58'' в.д.'),
    (466, 5, 86, 'RO-49',   null, '1944-05-19', '1945-04-05', 'DD-475 Hudson, у Окинавы 26°22'' с.ш. 126°30'' в.д.'),
    (467, 5, 86, 'RO-50',   null, '1944-07-31',  null,         null),
    (468, 5, 86, 'RO-55',   null, '1944-09-30', '1945-02-07', 'DE-203 Thomason, Лузон 15°27'' с.ш. 119°25'' в.д.'),
    (469, 5, 86, 'RO-56',   null, '1944-11-15', '1945-04-09', 'DD-798 Monssen, DD-691 Mertz, у Окинавы 26°09'' с.ш. 130°21'' в.д.');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (470, 5, 87, 'RO-33',   null, '1935-10-07', '1942-08-29', 'HMAS Arunta, Новая Гвинея 09°36'' с.ш. 147°06'' в.д.'),
    (471, 5, 87, 'RO-34',   null, '1937-05-31', '1943-04-05', 'DD-450 O''Bannon, DD-467 Strong, Соломоновы острова 10°05'' ю.ш. 162°08'' в.д.');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (472, 5, 88, 'RO-100',  null, '1942-09-23', '1943-11-25', 'подоврался на мине, Бугенвиль 06°50'' ю.ш. 155°58'' в.д.'),
    (473, 5, 88, 'RO-101',  null, '1942-10-31', '1943-09-15', 'DD-465 Saufley, Соломоновы острова'),
    (474, 5, 88, 'RO-102',  null, '1942-11-17', '1943-05-14', 'Новая Гвинея'),
    (475, 5, 88, 'RO-103',  null, '1942-10-21', '1943-07-28',  null),
    (476, 5, 88, 'RO-104',  null, '1943-02-25', '1944-05-23', 'DE-635 England, DE-697 George,  архипелаг Бисмарка 01°26'' с.ш. 149°20'' в.д.'),
    (477, 5, 88, 'RO-105',  null, '1943-03-05', '1944-05-31', 'DE-635 England, DE-696 Spanger, архипелаг Бисмарка 00°47'' с.ш. 149°56'' в.д.'),
    (478, 5, 88, 'RO-106',  null, '1943-12-25', '1944-05-22', 'DE-635 England, DE-697 George,  архипелаг Бисмарка 01°40'' с.ш. 150°31'' в.д.'),
    (479, 5, 88, 'RO-107',  null, '1942-12-26', '1943-07-12', 'DD-468 Taylor, Соломоновы острова'),
    (480, 5, 88, 'RO-108',  null, '1943-04-20', '1944-05-26', 'DE-635 England, у Новой Гвинеи 00°32'' ю.ш. 148°35'' в.д.'),
    (481, 5, 88, 'RO-109',  null, '1943-04-30', '1945-04-25', 'APD-124 Horace A. Bass, у Окинавы 21°58'' с.ш. 129°38'' в.д.'),
    (482, 5, 88, 'RO-110',  null, '1943-07-06', '1944-02-11', 'HMAS Ipswich, HMAS Launceston, 17°25'' с.ш. 83°21'' в.д.'),
    (483, 5, 88, 'RO-111',  null, '1943-07-19', '1944-06-11', 'DD-468 Taylor, архипелаг Бисмарка 00°26'' с.ш. 149°16'' в.д.'),
    (484, 5, 88, 'RO-112',  null, '1943-09-15', '1945-02-11', 'торпедирован SS-310 Batfish, Филиппины 18°53'' с.ш. 121°47'' в.д.'),
    (485, 5, 88, 'RO-113',  null, '1943-10-12', '1945-02-12', 'торпедирован SS-310 Batfish, Филиппины 19°10'' с.ш. 121°23'' в.д.'),
    (486, 5, 88, 'RO-114',  null, '1943-11-20', '1944-06-17', 'DD-680 Melvin, DD-689 Wadleigh, Филлипинcкое море 15°02'' c.ш. 144°10'' в.д.'),
    (487, 5, 88, 'RO-115',  null, '1943-11-30', '1945-01-31', 'DE-442 Ulvert M. Moore, DD-587 Bell, DD-450 O''Bannon, 15°03'' с.ш. 119°07'' в.д.'),
    (488, 5, 88, 'RO-116',  null, '1944-01-21', '1944-05-24', 'DE-635 England, DE-697 George,  архипелаг Бисмарка 00°53'' с.ш. 149°14'' в.д.'),
    (489, 5, 88, 'RO-117',  null, '1944-01-31', '1944-06-17', 'PBY-4 Liberator с атолла Эниветок, у Марианских островов 11°05'' с.ш. 150°31'' в.д.');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (490, 5, 89, 'HA-201',  null, '1945-05-01',  null,         null),
    (491, 5, 89, 'HA-202',  null, '1945-05-01',  null,         null),
    (492, 5, 89, 'HA-203',  null, '1945-06-26',  null,         null),
    (493, 5, 89, 'HA-204',  null, '1945-06-25',  null,         null),
    (494, 5, 89, 'HA-205',  null, '1945-07-03',  null,         null),
    (495, 5, 89, 'HA-207',  null, '1945-08-14',  null,         null),
    (496, 5, 89, 'HA-208',  null, '1945-08-04',  null,         null),
    (497, 5, 89, 'HA-209',  null, '1945-08-04',  null,         null),
    (498, 5, 89, 'HA-210',  null, '1945-08-11',  null,         null),
    (499, 5, 89, 'HA-216',  null, '1945-08-16',  null,         null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (513, 5, 93, 'RO-57', null, '1922-07-30', '1945-05-01', 'списан'),
    (514, 5, 93, 'RO-58', null, '1922-11-25', '1945-05-01', 'списан'),
    (515, 5, 93, 'RO-59', null, '1923-03-20', '1945-05-01', 'списан');
    

