
insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (386, 11, 70, 'I-5',    null, '1932-07-31', '1944-07-19', null),
    (387, 11, 71, 'I-6',    null, '1935-05-15', '1944-06-16', null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (388, 11, 72, 'I-7',    null, '1937-03-31', '1943-07-05', 'поврежден DD-354 Monaghan, затоплен экипажем у острова Кыска'),
    (389, 11, 72, 'I-8',    null, '1938-12-05', '1945-03-31', 'DD-560 Morrison, DD-646 Stockton, около Окинавы');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (390, 11, 73, 'I-9',    null, '1941-02-13', '1943-06-11', 'DD-607 Frazier, Алеутские острова 52°08'' с.ш. 177°03'' в.д.'),
    (391, 11, 73, 'I-10',   null, '1941-10-31', '1944-07-04', 'DE-185 Riddle, DD-551 David W. Taylor, Марианские острова 15°26'' с.ш. 147°48'' в.д.'),
    (392, 11, 73, 'I-11',   null, '1942-05-16', '1944-01-11', 'у островов Эллис');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (393, 11, 74, 'I-12',   null, '1944-05-25', '1944-11-13', '31°48'' с.ш. 139°52'' 139°45'' з.д.');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (394, 11, 75, 'I-13',   null, '1944-12-16', '1945-07-16', 'DE-415 Lawrence C. Taylor, у Йокосуки 34°28'' с.ш. 150°55'' в.д.'),
    (395, 11, 75, 'I-14',   null, '1945-03-14',  null,         null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (396, 11, 76, 'I-15',   null, '1940-09-30', '1942-11-10', 'DD-488 McCalla'),
    (397, 11, 76, 'I-17',   null, '1941-01-24', '1943-08-19', 'тральщик Tui'),
    (398, 11, 76, 'I-19',   null, '1941-04-28', '1943-11-25', 'DD-446 Radford'),
    (399, 11, 76, 'I-21',   null, '1941-07-25', '1943-11-29', 'у Таравы'),
    (400, 11, 76, 'I-23',   null, '1941-09-27', '1942-02-28', 'Гаваи'),
    (401, 11, 76, 'I-25',   null, '1941-10-15', '1943-09-03',  null),
    (402, 11, 76, 'I-26',   null, '1941-11-06', '1944-10-26', 'залив Лейте'),
    (403, 11, 76, 'I-27',   null, '1942-02-24', '1944-02-12', '01°25'' с.ш. 72°22'' в.д.'),
    (404, 11, 76, 'I-28',   null, '1942-02-06', '1942-05-17', 'торпедирован SS-199 Tautog, 06°30'' с.ш. 152°00'' в.д.'),
    (405, 11, 76, 'I-29',   null, '1942-02-27', '1944-07-26', 'торпедирован SS-276 Sawfish, 20°10'' с.ш. 121°55'' в.д.'),
    (406, 11, 76, 'I-30',   null, '1942-02-28', '1942-10-13', 'подорвался на мине, 3 мили к востоку от Кеппель-Харбор'),
    (407, 11, 76, 'I-31',   null, '1942-05-30', '1943-05-13', 'DD-607 Frazier'),
    (408, 11, 76, 'I-32',   null, '1942-04-26', '1944-03-24',  null),
    (409, 11, 76, 'I-33',   null, '1942-06-10', '1944-06-13', 'затонул 1942-09-26, поднят и к 1944-06-01 восстановлен, затонул на испытаниях'),
    (410, 11, 76, 'I-34',   null, '1942-08-31', '1943-11-13', 'HMS Taurus, 05°17'' c.ш. 10°05'' в.д.'),
    (411, 11, 76, 'I-35',   null, '1942-08-31', '1943-11-23', 'DD-602 Meade, DD-607 Frazier, 01°22'' с.ш. 142°47'' в.д.'),
    (412, 11, 76, 'I-36',   null, '1942-09-30',  null,         null),
    (413, 11, 76, 'I-37',   null, '1943-03-10', '1944-11-19', 'DE-439 Conklin'),
    (414, 11, 76, 'I-38',   null, '1943-01-31', '1944-11-13',  null),
    (415, 11, 76, 'I-39',   null, '1943-04-22', '1943-11-26',  null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (416, 11, 77, 'I-16',   null, '1940-03-30', '1944-05-19', '05°10'' ю.ш. 158°10'' в.д.'),
    (417, 11, 77, 'I-18',   null, '1941-01-31', '1943-02-11', 'DD-445 Fletcher, 14°15'' ю.ш. 161°53'' в.д.'),
    (418, 11, 77, 'I-20',   null, '1940-09-26', '1943-08-31', 'ПОТЕРЯНА ПОСЛЕ'),
    (419, 11, 77, 'I-22',   null, '1941-03-10', '1942-10-06', 'PBY-5 Catalina с Гуадалканала, 11°22'' ю.ш. 162°20'' в.д.'),
    (420, 11, 77, 'I-24',   null, '1941-10-31', '1943-06-11', 'патрульным катером PC-487, 53°16'' с.ш. 174°24'' в.д.');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (421, 11, 78, 'I-400',  null, '1944-12-30', '1945-08-19', 'ЗАХВАЧЕН DD-744 Blue'),
    (422, 11, 78, 'I-401',  null, '1945-01-08', '1945-08-29', 'ЗАХВАЧЕН SS-398 Segundo'),
    (423, 11, 78, 'I-402',  null, '1945-07-24',  null,         null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (424, 11, 79, 'I-40',   null, '1943-07-31', '1943-11-22', 'ПОТЕРЯНА ПОСЛЕ'),
    (425, 11, 79, 'I-41',   null, '1943-09-18', '1944-11-18', 'DD-415 Lawrence C. Taylor, DD-416 Melvin R. Nawman, 12°44'' с.ш. 130°42'' в.д.'),
    (426, 11, 79, 'I-42',   null, '1943-11-03', '1944-03-23', 'SS-282 Tunny, 06°40'' с.ш. 134°03'' в.д.'),
    (427, 11, 79, 'I-43',   null, '1943-11-05', '1944-02-15', 'SS-309 Aspro, 10°23'' с.ш. 150°23'' в.д.'),
    (428, 11, 79, 'I-44',   null, '1944-01-31', '1945-04-29', 'TBM Avenger авиагруппы CVE-72 Tulagi, 24°15'' с.ш. 131°16'' в.д.'),
    (429, 11, 79, 'I-45',   null, '1943-12-28', '1944-10-29', '10°10'' с.ш. 127°28'' в.д.');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (430, 11, 81, 'I-54',   null, '1944-03-31', '1944-10-28', '10°58'' с.ш. 127°13'' в.д.'),
    (431, 11, 81, 'I-56',   null, '1944-06-08', '1945-04-08', 'DD-730 Collett, DD-534 McCord, DD-691 Mertz, 26°42'' с.ш. 130°38'' в.д.'),
    (432, 11, 81, 'I-58',   null, '1944-09-07',  null,         null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (500, 11, 90, 'I-361',  null, '1944-05-25', '1945-05-31', 'TBM Avenger, 30°22'' с.ш. 134°09'' в.д.'),
    (501, 11, 90, 'I-362',  null, '1944-05-23', '1945-01-14', 'DE-32 Fleming, 12°08'' с.ш. 154°27'' в.д.'),
    (502, 11, 90, 'I-363',  null, '1944-07-08',  null,         null),
    (503, 11, 90, 'I-364',  null, '1944-06-14', '1944-09-16', 'SS-400 Seadevil, 34°30'' с.ш. 145°23'' в.д.'),
    (504, 11, 90, 'I-365',  null, '1944-08-01', '1944-11-29', 'SS-397 Scabbardfish, 34°44'' с.ш. 141°01'' в.д.'),
    (505, 11, 90, 'I-366',  null, '1944-08-03',  null,         null),
    (506, 11, 90, 'I-367',  null, '1944-08-15',  null,         null),
    (507, 11, 90, 'I-368',  null, '1944-08-25', '1945-02-26', 'TBM Avenger авиагруппы CVE-57 Anzio, 24°43'' с.ш. 140°37'' в.д.'),
    (508, 11, 90, 'I-369',  null, '1944-10-09',  null,         null),
    (509, 11, 90, 'I-370',  null, '1944-09-04', '1945-02-26', 'DE-307 Finnegan, 22°44'' с.ш. 141°26'' в.д.'),
    (510, 11, 90, 'I-371',  null, '1944-10-02', '1945-02-24', 'SS-371 Lagato, 32°40'' с.ш. 132°33'' в.д.');

