
insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    ( 90, 3, 42, 'Моми',        'Momi',         '1919-12-27', '1937-01-01', 'списан'), /* неточная дата окончания */
    ( 91, 3, 42, 'Кая',         'Kaya',         '1920-03-28', '1940-02-01', 'списан'), /* по данным Альпакова 01.1937 */
    ( 92, 3, 42, 'Наси',        'Nashi',        '1919-12-10', '1940-02-01', 'списан'), /* по данным Альпакова 01.1937 */
    ( 93, 3, 42, 'Таке',        'Take',         '1919-12-25',  null,         null),
    ( 94, 3, 42, 'Каки',        'Kaki',         '1920-08-02',  null,         null),
    ( 95, 3, 42, 'Цуга',        'Tsuga',        '1920-06-20', '1945-01-15', 'бухта Макунг, авиацией TF-38'),
    ( 96, 3, 42, 'Нире',        'Nire',         '1920-03-31',  null,         null),
    ( 97, 3, 42, 'Кури',        'Kuri',         '1920-04-30', '1945-10-08', 'подорвался на Мине у Пусана'),
    ( 98, 3, 42, 'Кику',        'Kiku',         '1920-12-10', '1944-03-30', 'авиацией, у Палау'),
    ( 99, 3, 42, 'Аои',         'Aoi',          '1920-12-10', '1941-12-23', 'береговой артиллерией, Уэйк'),
    (100, 3, 42, 'Хаги',        'Hagi',         '1921-04-20', '1941-12-23', 'береговой артиллерией, Уэйк'),
    (101, 3, 42, 'Фудзи',       'Fuji',         '1921-05-31',  null,         null),
    (102, 3, 42, 'Сусуки',      'Susuki',       '1921-05-25', '1944-07-03', 'авиацией, Трук'),
    (103, 3, 42, 'Хиси',        'Hishi',        '1922-03-23', '1942-01-24', 'торпедирован DE-134 Pope'),
    (104, 3, 42, 'Хасу',        'Hasu',         '1922-07-31',  null,         null),
    (105, 3, 42, 'Вараби',      'Warabi',       '1921-12-19', '1927-08-24', 'столкновение с крейсером Дзинцу'),
    (106, 3, 42, 'Таде',        'Tade',         '1922-07-31', '1943-04-23', 'торпедирован SS-197 Seawolf'),
    (107, 3, 42, 'Сумире',      'Sumire',       '1922-03-31',  null,         null),
    (108, 3, 42, 'Цута',        'Tsuta',        '1921-06-30', '1943-09-02', 'авиацией, Лае, Новая Гвинея'),
    (109, 3, 42, 'Аси',         'Ashi',         '1921-10-29',  null,         null),
    (110, 3, 42, 'Емоги',       'Yomogi',       '1922-08-19', '1944-11-25', 'торпедирован SS-403 Atule');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (111, 3, 44, 'Минекадзе',   'Minekaze',     '1920-05-29', '1944-02-10', 'торпедирован SS-266 Pogy, к востоку от Тайваня'),
    (112, 3, 44, 'Савакадзе',   'Sawakaze',     '1920-03-06',  null,         null),
    (113, 3, 44, 'Окикадзе',    'Okikaze',      '1920-08-17', '1943-01-10', 'подорвался на мине выставленной SS-237 Trigger, к югу от Йокосуки'),
    (114, 3, 44, 'Симакадзе',   'Shimakaze',    '1920-11-15', '1943-01-13', 'торпедирован SS-217 Guardfish, юго-западнее Кавиенга'),
    (115, 3, 44, 'Надакадзе',   'Nadakaze',     '1921-09-30',  null,        'ПОВРЕЖДЕН 25.07.1945, не восстановлен'),
    (116, 3, 44, 'Якадзе',      'Yakaze',       '1920-07-19',  null,        'ПОВРЕЖДЕН 18.07.1945, не восстановлен'),
    (117, 3, 44, 'Хакадзе',     'Hakaze',       '1920-09-16', '1943-01-23', 'торпедирован SS-217 Guardfish 15 миль юго-западнее Кавиенга'),
    (118, 3, 44, 'Сиокадзе',    'Shiokaze',     '1921-07-29',  null,         null),
    (119, 3, 44, 'Акикадзе',    'Akikaze',      '1921-09-16', '1944-11-03', 'торпедирован SS-387 Pintado, к югу от Лусона'),
    (120, 3, 44, 'Юкадзе',      'Yukaze',       '1921-08-24',  null,         null),
    (121, 3, 44, 'Татикадзе',   'Tachikaze',    '1921-12-05', '1944-02-17', 'авиацией, Трук'),
    (122, 3, 44, 'Хокадзе',     'Hokaze',       '1921-12-22', '1944-07-06', 'торпедирован SS-263 Paddle, к северу от Целебес'),
    (123, 3, 44, 'Нокадзе',     'Nokaze',       '1922-03-31', '1945-02-20', 'торпедирован SS-264 Pargo, у Камрани'),
    (124, 3, 44, 'Намикадзе',   'Namikaze',     '1922-11-11',  null,         null),
    (125, 3, 44, 'Нумакадзе',   'Numakaze',     '1922-07-24', '1943-12-19', 'торпедирован SS-208 Grayback, юго-восточнее Окинавы');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (126, 3, 43, 'Вакатаке',    'Wakatake',     '1922-09-30', '1944-03-30', 'авиацией, Палау'),
    (127, 3, 43, 'Куретаке',    'Kuretake',     '1922-12-21', '1944-12-30', 'торпедирован SS-394 Razorback, 65 миль юго-западнее острова Формоза'),
    (128, 3, 43, 'Санае',       'Sanae',        '1923-11-05', '1943-11-13', 'торпедирован SS-222 Bluefish, море Сулавеси'),
    (129, 3, 43, 'Савараби',    'Sawarabi',     '1924-07-24', '1932-12-05', 'шторм в Тайваньском проливе'),
    (130, 3, 43, 'Асагао',      'Asagao',       '1923-05-10',  null,        'ПОВРЕЖДЕН 1945-08-22, подорвался на мине в Симоносекском проливе, не восстановлен'),
    (131, 3, 43, 'Югао',        'Yugao',        '1924-05-31', '1944-11-10', 'торпедирован SS-213 Greenling, Йокогама'),
    (132, 3, 43, 'Фуё',         'Fuyo',         '1923-03-16', '1943-12-20', 'торпедирован SS-268 Puffer, Манильская бухта'),
    (133, 3, 43, 'Карукая',     'Karukaya',     '1923-08-20', '1944-05-10', 'торпедирован SS-224 Cod, к западу от Лусона');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (134, 3, 45, 'Камикадзе',   'Kamikaze',     '1922-12-19',  null,         null),
    (135, 3, 45, 'Асакадзе',    'Asakaze',      '1923-06-16', '1944-08-23', 'торпедирован SS-255 Haddo, Лусон'),
    (136, 3, 45, 'Харукадзе',   'Harukaze',     '1923-05-31',  null,         null),
    (137, 3, 45, 'Мацукадзе',   'Matsukaze',    '1924-04-05', '1944-06-09', 'торпедирован SS-193 Swordfish, остров Бонин'),
    (138, 3, 45, 'Хатакадзе',   'Hatakaze',     '1924-08-30', '1945-01-15', 'авиацией, залив Такао'),
    (139, 3, 45, 'Оите',        'Oite',         '1925-10-30', '1944-02-17', 'авиацией, Трук'),
    (140, 3, 45, 'Хаяте',       'Hayate',       '1925-12-21', '1941-12-11', 'береговой артиллерией, Уэйк'),
    (141, 3, 45, 'Асанаги',     'Asanagi',      '1924-12-29', '1944-05-22', 'торпедирован SS-180 Pollack, остров Бонин'),
    (142, 3, 45, 'Юнаги',       'Yunagi',       '1925-05-24', '1944-08-25', 'торпедирован SS-382 Picuda');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (143, 3, 46, 'Муцуки',      'Mutsuki',      '1926-03-25', '1942-08-25', 'авиацией, Соломоновы острова'),
    (144, 3, 46, 'Кисараги',    'Kisaragi',     '1925-12-21', '1941-12-11', 'Уэйк'),
    (145, 3, 46, 'Яей',         'Yayoi',        '1926-08-28', '1942-09-11', 'авиацией, у Новой Британии'),
    (146, 3, 46, 'Удзуки',      'Uzuki',        '1926-09-14', '1944-12-12', 'у острова Себу'),
    (147, 3, 46, 'Сацуки',      'Satsuki',      '1925-11-15', '1944-09-21', 'Манильская бухта'),
    (148, 3, 46, 'Минадзуки',   'Minazuki',     '1927-03-22', '1944-06-06', 'торпедирован SS-257 Harder, море Сулавеси'),
    (149, 3, 46, 'Фумидзуки',   'Fumizuki',     '1926-07-03', '1944-02-18', 'Трук'),
    (150, 3, 46, 'Нагацуки',    'Nagatsuki',    '1927-04-30', '1943-07-06', 'сел на мель, сражение в заливе Кула'),
    (151, 3, 46, 'Кикудзуки',   'Kikuzuki',     '1926-11-20', '1942-05-05', 'у острова Тулаги'),
    (152, 3, 46, 'Микадзуки',   'Mikazuki',     '1927-05-05', '1943-07-29', 'сел на мель, мыс Глотчестер'),
    (153, 3, 46, 'Мотидзуки',   'Mochizuki',    '1927-10-31', '1943-10-24', 'авиацией, Соломоновы острова'),
    (154, 3, 46, 'Юдзуки',      'Yuzuki',       '1927-07-25', '1944-12-12', 'авиацией, у острова Себу');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (155, 3, 47, 'Фубуки',      'Fubuki',       '1928-08-10', '1942-10-11', 'у мыса Эсперанс 09°06'' ю.ш. 159°38'' в.д.'),
    (156, 3, 47, 'Сираюки',     'Shirayuki',    '1928-12-18', '1943-03-03', 'авиацией, сражение в море Бисмарка 07°15'' ю.ш. 148°30'' в.д.'),
    (157, 3, 47, 'Хацуюки',     'Hatsuyuki',    '1929-03-30', '1943-07-17', 'авиацией, 06°50'' ю.ш. 155°47'' в.д.'),
    (158, 3, 47, 'Миюки',       'Miyuki',       '1929-06-29', '1934-06-29', 'столкновение с эсминцем Инадзума, Корейский пролив'),
    (159, 3, 47, 'Муракумо',    'Murakumo',     '1929-05-10', '1942-10-12', 'авиацией, у мыса Эсперанс, 08°40'' ю.ш. 159°20'' в.д.'),
    (160, 3, 47, 'Синономе',    'Sinonome',     '1928-07-25', '1941-12-17', 'авиайией, 04°24'' с.ш. 114°00'' в.д.'),
    (161, 3, 47, 'Усугумо',     'Usugumo',      '1928-07-26', '1944-07-07', 'торпедирован SS-305 Skate, 47°43'' с.ш. 147°55'' в.д.'),
    (162, 3, 47, 'Сиракумо',    'Shirakumo',    '1928-07-28', '1944-03-16', 'торпедирован SS-199 Tautog, 42°25'' с.ш. 144°55'' в.д.'),
    (163, 3, 47, 'Исонами',     'Isonami',      '1928-06-30', '1943-04-09', 'торпедирован SS-199 Tautog, к юго-западу от Сулавеси 05°26'' ю.ш. 123°04'' в.д.'),
    (164, 3, 47, 'Уранами',     'Uranami',      '1929-06-30', '1944-10-26', 'авиацией, залив Лейте, Сибуян 11°55'' с.ш. 123°00'' в.д.'),
    (165, 3, 47, 'Аянами',      'Ayanami',      '1930-04-30', '1942-11-15', 'поврежден линкором BB-56 Washington в проливе Железное Дно, добит торпедами Уранами 09°10'' ю.ш. 159°52'' в.д.'),
    (166, 3, 47, 'Сикинами',    'Shikinami',    '1929-12-24', '1944-09-12', 'торпедирован SS-215 Growler, 18°16'' с.ш. 114°40'' в.д.'),
    (167, 3, 47, 'Асагири',     'Asagiri',      '1930-06-30', '1942-08-28', 'авиацией, Гуадалканал 08°00'' ю.ш. 160°10'' в.д.'),
    (168, 3, 47, 'Югири',       'Yugiri',       '1930-12-03', '1943-11-25', 'сражение у мыса Сент-Джордж 04°44'' ю.ш. 154°00'' в.д.'),
    (169, 3, 47, 'Амагири',     'Amagiri',      '1930-11-10', '1944-04-23', 'подорвался на мине, 02°10'' ю.ш. 116°45'' в.д.'),
    (170, 3, 47, 'Сагири',      'Sagiri',       '1931-01-30', '1941-12-24', 'торпедирован Голландской K-XV 01°34'' с.ш. 110°21'' в.д.'),
    (171, 3, 47, 'Оборо',       'Oboro',        '1931-10-31', '1942-10-16', 'авицией, у острова Кыска 52°17'' с.ш. 178°08'' в.д.'),
    (172, 3, 47, 'Акебоно',     'Akebono',      '1931-07-31', '1944-11-13', 'авиацией, Манильская бухта 14°35'' с.ш. 120°50'' в.д.'),
    (173, 3, 47, 'Садзанами',   'Sazanami',     '1932-05-19', '1944-01-14', 'торпедирован SS-218 Albacore, 05°15'' с.ш. 141°15'' в.д.'),
    (174, 3, 47, 'Усио',        'Ushio',        '1931-11-14',  null,         null),
    (175, 3, 47, 'Акацуки',     'Akatsuki',     '1932-11-30', '1942-11-13', 'Гуадалканал 09°17'' ю.ш. 159°56'' в.д.'),
    (176, 3, 47, 'Инадзума',    'Inazuma',      '1932-11-15', '1944-05-14', 'торпедирован SS-223 Bonefish, к западу от Сулавеси 05°08'' с.ш. 119°38'' в.д.'),
    (177, 3, 47, 'Икадзути',    'Ikazuchi',     '1932-08-15', '1944-04-13', 'торпедирован SS-257 Harder, 10°13'' c.ш. 143°51'' в.д.'),
    (178, 3, 47, 'Хибики',      'Hibiki',       '1932-03-31',  null,         null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (179, 3, 48, 'Хацухару',    'Hatsuharu',    '1933-09-30', '1944-11-13', 'авиацией, Манильский залив'),
    (180, 3, 48, 'Ненохи',      'Nenohi',       '1933-09-30', '1942-07-05', 'торпедирован SS-201 Triton, у острова Ататту'),
    (181, 3, 48, 'Вакаба',      'Wakaba',       '1934-10-31', '1944-10-24', 'авиацией, залив Лейте'),
    (182, 3, 48, 'Хацусимо',    'Hatsushimo',   '1934-09-27', '1945-07-30', 'подорвался на мине, у Майдзуру'),
    (183, 3, 48, 'Ариаке',      'Ariake',       '1935-03-25', '1943-07-27', 'сел на риф, у Новой Британии'),
    (184, 3, 48, 'Югуре',       'Yugure',       '1935-03-30', '1943-07-20', 'авиацией, у Коломбангары');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (185, 3, 53, 'Сирацую',     'Shiratsuyu',   '1936-08-20', '1944-06-15', 'столкновение с танкером Сейе Мару'),
    (186, 3, 53, 'Сигуре',      'Shigure',      '1936-09-07', '1945-01-24', 'торпедирован SS-322 Blackfin'),
    (187, 3, 53, 'Мурасаме',    'Murasame',     '1937-01-07', '1943-03-05', 'торпедирован DD-466 Waller, Соломоновы острова'),
    (188, 3, 53, 'Юдати',       'Yudachi',      '1937-01-07', '1942-11-13', 'крейсером CA-33 Portland, Гуадалканал'),
    (189, 3, 53, 'Самидаре',    'Samidare',     '1937-01-29', '1944-08-25', 'торпедирован SS-310 Batfish'),
    (190, 3, 53, 'Харусаме',    'Harusame',     '1937-08-26', '1944-06-08', 'авиацией, у Новой Гвинеи'),
    (191, 3, 53, 'Ямакадзе',    'Yamakaze',     '1937-01-30', '1942-06-25', 'торпедирован SS-168 Nautilus, у Йокосуки'),
    (192, 3, 53, 'Кавакадзе',   'Kawakaze',     '1937-04-30', '1943-08-07', 'эсминцами, бой в заливе Велья'),
    (193, 3, 53, 'Умикадзе',    'Umikaze',      '1937-05-31', '1944-02-01', 'торпедирован SS-217 Guardfish'),
    (194, 3, 53, 'Судзукадзе',  'Suzukaze',     '1937-08-31', '1944-01-26', 'торпедирован SS-184 Skipjack');
    

insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (195, 3, 54, 'Асасио',      'Asashio',      '1937-08-31', '1943-03-04', 'авиацией, море Бисмарка'),
    (196, 3, 54, 'Осио',        'Oshio',        '1937-10-31', '1943-02-20', 'торпедирован SS-218 Albacore, 00°50'' ю.ш. 146°06'' в.д.'),
    (197, 3, 54, 'Митисио',     'Michishio',    '1937-10-31', '1944-10-25', 'залив Лейте, Суригао'),
    (198, 3, 54, 'Арасио',      'Arashio',      '1937-12-30', '1943-03-04', 'авиацией, море Бисмарка'),
    (199, 3, 54, 'Нацугумо',    'Natsugumo',    '1938-02-10', '1942-11-12', 'авиацией, у мыса Эсперанс'),
    (200, 3, 54, 'Ямагумо',     'Yamagumo',     '1938-01-15', '1944-10-25', 'залив Лейте, Суригао'),
    (201, 3, 54, 'Минегумо',    'Minegumo',     '1938-04-30', '1943-03-06', 'залив Блекетт'),
    (202, 3, 54, 'Асагумо',     'Asagumo',      '1938-03-31', '1944-10-25', 'залив Лейте, Суригао'),
    (203, 3, 54, 'Араре',       'Arare',        '1939-04-15', '1942-07-05', 'торпедирован SS-215 Growler'),
    (204, 3, 54, 'Касуми',      'Kasumi',       '1939-06-24', '1945-04-07', 'авиацией, Тен-Го');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (205, 3, 52, 'Кагеро',      'Kagero',       '1939-11-06', '1943-05-08', 'авиацией, у острова Рендова, 08°08'' ю.ш. 156°55'' в.д.'),
    (206, 3, 52, 'Сирануи',     'Shiranui',     '1939-12-20', '1944-10-27', 'авиацией, Филлипины'),
    (207, 3, 52, 'Куросио',     'Kuroshio',     '1940-01-27', '1943-05-08', 'подорвался на мине, у острова Рендова'),
    (208, 3, 52, 'Оясио',       'Oyashio',      '1940-08-20', '1943-05-08', 'подорвался на мине, у острова Рендова'),
    (209, 3, 52, 'Хаясио',      'Hayashio' ,    '1940-08-31', '1942-11-24', 'авиацией, залив Хуон'),
    (210, 3, 52, 'Нацусио',     'Natsushio',    '1940-08-31', '1942-02-09', 'торпедирован SS-142'),
    (211, 3, 52, 'Хацукадзе',   'Hatsukaze',    '1940-02-15', '1943-11-02', 'столкновение с Меко, добит американскими эсминцами, залив императрицы Августы, 06°01'' ю.ш. 153°58'' в.д.'),
    (212, 3, 52, 'Юкикадзе',    'Yukikaze',     '1940-01-20',  null,         null),
    (213, 3, 52, 'Амацукадзе',  'Amatsukaze',   '1940-10-26', '1945-04-06', 'авиацией, южнее Тайваня'),
    (214, 3, 52, 'Токицукадзе', 'Tokitsukaze',  '1940-12-15', '1943-03-03', 'авиацией, море Бисмарка'),
    (215, 3, 52, 'Уракадзе',    'Urakaze',      '1940-12-15', '1944-11-21', 'торпедирован SS-315 Sealion, у Тайваня'),
    (216, 3, 52, 'Исокадзе',    'Isokaze',      '1940-11-30', '1945-04-07', 'авиацией, Тен-Го'),
    (217, 3, 52, 'Хамакадзе',   'Hamakaze',     '1941-06-30', '1945-04-07', 'авиацией, Тен-Го'),
    (218, 3, 52, 'Таникадзе',   'Tanikaze',     '1941-04-25', '1944-06-09', 'торпедирован SS-257 Harder, море Сулавеси'),
    (219, 3, 52, 'Новаки',      'Nowaki',       '1941-04-28', '1944-10-26', 'залив Лейте'),
    (220, 3, 52, 'Араси',       'Arashi',       '1941-01-27', '1943-08-06', 'сражение в заливе Велья'),
    (221, 3, 52, 'Хагикадзе',   'Hagikaze',     '1941-03-31', '1943-08-06', 'сражение в заливе Велья'),
    (222, 3, 52, 'Майкадзе',    'Maikaze',      '1941-07-15', '1944-02-17', 'Трук'),
    (223, 3, 52, 'Акигумо',     'Akigumo',      '1941-09-27', '1944-04-11', 'торпедирован SS-272 Redfin, Филлипины');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (224, 3, 51, 'Югумо',       'Yugumo',       '1941-12-05', '1943-10-06', 'сражение у Велья-Лавелья, 07°33'' ю.ш. 156°14'' в.д.'),
    (225, 3, 51, 'Макигумо',    'Makigumo',     '1942-03-14', '1943-02-01', 'подорвался на мине, у строва Саво, 09°15'' ю.ш. 159°47'' в.д.'),
    (226, 3, 51, 'Кадзaгумо',   'Kazagumo',     '1942-03-28', '1944-06-08', 'торпедирован SS-256 Hake, залив Давао, 06°03'' с.ш. 124°57'' в.д.'),
    (227, 3, 51, 'Наганами',    'Naganami',     '1942-06-30', '1944-11-11', 'авиацией, сражение в Ормокском заливе, 10°50'' с.ш. 124°34'' в.д.'),
    (228, 3, 51, 'Макинами',    'Makinami',     '1942-08-08', '1943-11-25', 'сражение у мыса Сент-Джордж, 05°14'' ю.ш. 153°50'' в.д.'),
    (229, 3, 51, 'Таканами',    'Takanami',     '1942-08-31', '1942-11-30', 'у Тассафаронга, 09°18'' ю.ш. 159°56'' в.д.'),
    (230, 3, 51, 'Онами',       'Onami',        '1942-12-29', '1943-11-25', 'сражение у мыса Сент-Джордж, 05°15'' ю.ш. 153°49'' в.д.'),
    (231, 3, 51, 'Киенами',     'Kiyonami',     '1943-01-25', '1943-07-20', 'авиацией, у Коломбангары, 07°13'' ю.ш. 156°45'' в.д.'),
    (232, 3, 51, 'Таманами',    'Tamanami',     '1943-04-30', '1944-07-07', 'торпедирован SS-261 Mingo, у Манилы, 13°55'' с.ш. 118°30'' в.д.'),
    (233, 3, 51, 'Судзунами',   'Suzunami',     '1943-07-27', '1943-11-11', 'авиацией, Рабаул'),
    (234, 3, 51, 'Фудзинами',   'Fujinami',     '1943-07-31', '1944-10-27', 'авиацией, 12°00'' с.ш. 122°30'' в.д.'),
    (235, 3, 51, 'Хаянами',     'Hayanami',     '1943-07-31', '1944-06-07', 'торпедирован SS-257 Harder, у Калимантана, 04°43'' с.ш. 120°03'' в.д.'),
    (236, 3, 51, 'Хаманами',    'Hamanami',     '1943-10-15', '1944-11-11', 'авиацией, сражение в Ормокском заливе, 10°50'' с.ш. 124°35'' в.д.'),
    (237, 3, 51, 'Окинами',     'Okinami',      '1943-12-10', '1944-11-13', 'авиацией, у Манилы, 14°35'' с.ш. 120°50'' в.д.'),
    (238, 3, 51, 'Кисинами',    'Kishinami',    '1943-12-03', '1944-12-04', 'торпедирован SS-249 Flasher, у Лусона, 13°12'' с.ш. 116°37'' в.д.'),
    (239, 3, 51, 'Асасимо',     'Asashimo',     '1943-11-27', '1945-04-07', 'авиацией, Тен-Го, 31°00'' с.ш. 128°00'' в.д.'),
    (240, 3, 51, 'Хаясимо',     'Hayashimo',    '1944-02-20', '1944-10-26', 'авиацией, залив Лейте, 12°50'' с.ш. 121°21'' в.д.'),
    (241, 3, 51, 'Акисимо',     'Akishimo',     '1944-03-11', '1944-11-13', 'авиацией, у Манилы, 14°35'' с.ш. 120°55'' в.д.'),
    (242, 3, 51, 'Киесимо',     'Kiyoshimo',    '1944-05-15', '1944-12-29', 'авиацией, у Манилы');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (243, 3, 49, 'Акидзуки',    'Akizuki',      '1942-06-11', '1944-10-25', 'торпедирован SS-232 Halibut'),
    (244, 3, 49, 'Терудзуки',   'Teruzuki',     '1942-08-31', '1942-12-11', 'торпедирован катерами PT-37 PT-40'),
    (245, 3, 49, 'Судзуцуки',   'Suzutsuki',    '1942-12-29',  null,         null),
    (246, 3, 49, 'Хацудзуки',   'Hatsuzuki',    '1942-12-29', '1944-10-25', 'залив Лейте'),
    (247, 3, 49, 'Ниидзуки',    'Niizuki',      '1943-03-31', '1943-07-06',  null),
    (248, 3, 49, 'Вакацуки',    'Wakatsuki',    '1943-05-31', '1944-11-11', 'авиацией'),
    (249, 3, 49, 'Симоцуки',    'Shimotsuki',   '1944-03-31', '1944-11-25', 'торпедирован SS-244 Cavalla'),
    (250, 3, 49, 'Фуюдзуки',    'Fuyutsui',     '1944-05-25',  null,        'ПОВРЕЖДЕН 20.08.1945, подорвался на мине, не восстановлен'),
    (251, 3, 49, 'Харуцуки',    'Harutsuki',    '1944-12-28',  null,         null),
    (252, 3, 49, 'Еидзуки',     'Yozuki',       '1945-01-31',  null,         null),
    (253, 3, 49, 'Нацудзуки',   'Natsuzuki',    '1945-04-08',  null,         null),
    (254, 3, 49, 'Ханадзуки',   'Hanazuki',     '1944-12-26',  null,         null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (255, 3, 50, 'Симакадзе',   'Shimakaze',    '1943-05-10', '1944-11-11', 'авиацией');


