
insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (516, 6, 94, 'Тидори',      'Chidori',      '1933-11-20', '1944-12-21', 'торпедирован SS-307 Talefish, западнее Омаедзаки 34°33''с.ш. 138°02''в.д.'),
    (517, 6, 94, 'Минадзуру',   'Minazuru',     '1934-01-31', '1945-03-01', 'авиацией, Нахи 26°17''с.ш. 127°35''в.д.'),
    (518, 6, 94, 'Томодзуру',   'Tomozuru',     '1934-02-24', '1945-03-24', 'авиацией, западнее Осима 29°15'' с.ш. 125°13'' в.д.'),
    (519, 6, 94, 'Хацукари',    'Hatsukari',    '1934-07-15',  null,         null);
    

insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (520, 6, 95, 'Отори',       'Otori',        '1936-10-10', '1944-06-12', 'авиацией, юго-западнее Сайпана'),
    (521, 6, 95, 'Хиедори',     'Hiyodori',     '1936-12-20', '1944-11-17', 'торпедирован SS-253 Gunnel, Южно-Китайское море'),
    (522, 6, 95, 'Хаябуса',     'Hayabusa',     '1936-12-07', '1944-09-24', 'авиацией, море Сибуян'),
    (523, 6, 95, 'Касасаги',    'Kasasagi',     '1937-01-25', '1943-09-26', 'торпедирован SS-222 Bluefish, юго-западнее Новой Британии'),
    (524, 6, 95, 'Кидзи',       'Kiji',         '1937-07-31',  null,         null),
    (525, 6, 95, 'Кари',        'Kari',         '1937-09-20', '1945-07-16', 'торпедирован SS-318 Baya, Яванское море'),
    (526, 6, 95, 'Саги',        'Sagi',         '1937-07-31', '1944-11-08', 'торпедирован SS-253 Gunnel, западнее Лусона'),
    (527, 6, 95, 'Хато',        'Hato',         '1937-08-07', '1944-10-16', 'авиацией, Гонконг');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (256, 6, 55, 'Симусю',      'Shimushu',     '1940-06-30',  null,         null),
    (257, 6, 55, 'Хатидзе',     'Hachijo',      '1941-03-31',  null,         null),
    (258, 6, 55, 'Кунасири',    'Kunashiri',    '1940-10-03',  null,         null),
    (259, 6, 55, 'Исигаки',     'Ishigaki',     '1941-02-15', '1944-05-31', 'торпедирован SS-233 Herring');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (260, 6, 56, 'Эторофу',     'Etorofu',      '1943-05-15',  null,         null),
    (261, 6, 56, 'Муцуре',      'Mutsure',      '1943-07-31', '1943-09-02', 'торпедирован SS-185 Snapper, юго-западнее Трука'),
    (262, 6, 56, 'Хирато',      'Hirado',       '1943-09-28', '1944-09-19', 'торпедирован SS-215 Growler, Южно-Китайское море'),
    (263, 6, 56, 'Амакуса',     'Amakusa',      '1943-11-20', '1945-08-09', 'авиацией, у острова Онагава'),
    (264, 6, 56, 'Оки',         'Oki',          '1943-03-28',  null,         null),
    (265, 6, 56, 'Фукае',       'Fukae',        '1943-06-28',  null,         null),
    (266, 6, 56, 'Кандзю',      'Kanju',        '1943-10-30', '1945-08-15', 'затоплен экипажем после подрыва на минее у порта Вонсан'),
    (267, 6, 56, 'Касадо',      'Kasado',       '1944-02-27',  null,         null),
    (268, 6, 56, 'Садо',        'Sado',         '1944-02-27', '1944-08-22', 'торпедирован SS-255 Haddo, у Манилы'),
    (269, 6, 56, 'Цусима',      'Tsushima',     '1944-07-28',  null,         null),
    (270, 6, 56, 'Мацува',      'Matsuwa',      '1943-03-23', '1944-08-22', 'торпедирован SS-257 Harder, у Манилы'),
    (271, 6, 56, 'Вакамия',     'Wakamiya',     '1943-08-10', '1943-11-23', 'торпедирован SS-211 Gudgeon, у побережья Китая'),
    (272, 6, 56, 'Мандзю',      'Manju',        '1943-11-30',  null,         null),
    (273, 6, 56, 'Ики',         'Iki',          '1943-05-31', '1944-05-24', 'торпедирован SS-270 Raton, восточнее Сингапура');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (274, 6, 58, 'Микура',      'Mikura',       '1943-10-30', '1945-03-28', 'торпедирован SS-410 Threadfin'),
    (275, 6, 58, 'Мияке',       'Miyake',       '1943-11-30',  null,         null),
    (276, 6, 58, 'Авадзи',      'Awaji',        '1944-02-15', '1944-06-02', 'торпедирован SS-363 Guitarro, у Тайваня'),
    (277, 6, 58, 'Курахаси',    'Kurahashi',    '1944-03-10',  null,         null),
    (278, 6, 58, 'Номи',        'Nomi',         '1944-03-15', '1945-04-14', 'торпедирован SS-420 Tirante, у побережья Кореи'),
    (279, 6, 58, 'Тибури',      'Chiburi',      '1944-03-13', '1945-03-12', 'авиацией, у побережья Вьетнама'),
    (280, 6, 58, 'Ясиро',       'Yashiro',      '1944-06-06',  null,         null),
    (281, 6, 58, 'Кусагаки',    'Kusagaki',     '1944-07-01', '1944-08-07', 'торпедирован SS-363 Guitarro, у побережья Вьетнама');


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (282, 6, 59, 'Укуру',       'Ukuru',        '1944-07-31',  null,         null),
    (283, 6, 59, 'Окинава',     'Okinawa',      '1944-08-16', '1945-07-30', 'авиацией'),
    (284, 6, 59, 'Синнан',      'Shinnan',      '1944-10-21',  null,         null),
    (285, 6, 59, 'Яку',         'Yaku',         '1944-10-23', '1945-02-23', 'торпедирован SS-364 Hammerhead'),
    (286, 6, 59, 'Агуни',       'Aguni',        '1944-12-02', '1945-05-27', 'ПОВРЕЖДЕН, не восстановлен'),
    (287, 6, 59, 'Инаги',       'Inagi',        '1944-12-16', '1945-08-09', 'авиацией'),
    (288, 6, 59, 'Уку',         'Uku',          '1944-12-30',  null,         null),
    (289, 6, 59, 'Тикубу',      'Chikubu',      '1944-12-31',  null,         null),
    (290, 6, 59, 'Хабуси',      'Habushi',      '1945-01-10',  null,         null),
    (291, 6, 59, 'Куга',        'Kuga',         '1945-01-25', '1945-06-25', 'ПОВРЕЖДЕН, подорвался на мине, не восстановлен'),
    (292, 6, 59, 'Одзика',      'Ojika',        '1945-02-21', '1945-06-02', 'торпедирован SS-414 Springer'),
    (293, 6, 59, 'Кодзу',       'Kozu',         '1945-02-07',  null,         null),
    (294, 6, 59, 'Канава',      'Kanawa',       '1945-03-15',  null,         null),
    (295, 6, 59, 'Сига',        'Shiga',        '1945-03-20',  null,         null),
    (296, 6, 59, 'Амами',       'Amami',        '1945-04-08',  null,         null),
    (297, 6, 59, 'Ходака',      'Hodaka',       '1945-03-30',  null,         null),
    (298, 6, 59, 'Иво',         'Iwo',          '1945-03-24',  null,         null),
    (299, 6, 59, 'Такане',      'Takane',       '1945-04-26',  null,         null),
    (300, 6, 59, 'Икара',       'Ikara',        '1945-04-30', '1945-08-09', 'подорвался на мине'),
    (301, 6, 59, 'Икуно',       'Ikuno',        '1945-07-17',  null,         null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (302, 6, 57, 'Мацу',        'Matsu',        '1944-04-28', '1944-08-04', 'у отсрова Бонин'),
    (303, 6, 57, 'Таке',        'Take',         '1944-06-16',  null,         null),
    (304, 6, 57, 'Уме',         'Ume',          '1944-06-28', '1945-01-31', 'авиацией, южнее Тайваня'),
    (305, 6, 57, 'Момо',        'Momo',         '1944-06-10', '1944-12-15', 'торпедирован SS-366 Hawkbill, у острова Лусон'),
    (306, 6, 57, 'Кува',        'Kuwa',         '1944-07-15', '1944-12-03', 'в бухте Ормок'),
    (307, 6, 57, 'Кири',        'Kiri',         '1944-08-14',  null,         null),
    (308, 6, 57, 'Суги',        'Sugi',         '1944-08-25',  null,         null),
    (309, 6, 57, 'Маки',        'Maki',         '1944-08-10',  null,         null),
    (310, 6, 57, 'Моми',        'Momi',         '1944-09-03', '1945-01-05', 'авиацией, юго-западнее Манилы'),
    (311, 6, 57, 'Каси',        'Kashi',        '1944-09-30',  null,         null),
    (312, 6, 57, 'Кая',         'Kaya',         '1944-09-30',  null,         null),
    (313, 6, 57, 'Нара',        'Nara',         '1944-11-26',  null,         null),
    (314, 6, 57, 'Сакура',      'Sakura',       '1944-11-25', '1945-07-11', 'подорвался на мине, порт Осака'),
    (315, 6, 57, 'Янаги',       'Yanagi',       '1945-01-08',  null,         null),
    (316, 6, 57, 'Цубаки',      'Tsubaki',      '1944-11-30',  null,         null),
    (319, 6, 57, 'Хиноки',      'Hinoki',       '1944-09-30', '1945-01-07', 'Манильский залив'),
    (320, 6, 57, 'Каеде',       'Kaede',        '1944-10-30',  null,         null),
    (321, 6, 57, 'Кеяки',       'Keyaki',       '1944-12-15',  null,         null);
    

insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (317, 6, 96, 'Каки',        'Kaki',         '1945-03-05',  null,         null),
    (318, 6, 96, 'Каба',        'Kaba',         '1945-05-29',  null,         null),
    (322, 6, 96, 'Татибана',    'Tachibana',    '1945-01-20', '1945-07-14', 'авиацией TF-38, Хакодате'),
    (323, 6, 96, 'Цута',        'Tsuta',        '1945-02-08',  null,         null),
    (324, 6, 96, 'Хаги',        'Hagi',         '1945-03-01',  null,         null),
    (325, 6, 96, 'Сумире',      'Sumire',       '1945-03-26',  null,         null),
    (326, 6, 96, 'Кусуноки',    'Kusunoki',     '1945-04-28',  null,         null),
    (327, 6, 96, 'Хацудзакура', 'Hatsuzakura',  '1945-05-18',  null,         null),
    (328, 6, 96, 'Нире',        'Nire',         '1945-01-31',  null,         null),
    (329, 6, 96, 'Наси',        'Nashi',        '1945-03-15', '1945-07-26', 'ракетами F6F Hellcat, TF-38, Куре'),
    (330, 6, 96, 'Сии',         'Shii',         '1945-03-13',  null,         null),
    (331, 6, 96, 'Эноки',       'Enoki',        '1945-03-31', '1945-06-26', 'подорвался на мине, пролив Обама'),
    (332, 6, 96, 'Одаке',       'Odake',        '1945-05-15',  null,         null),
    (333, 6, 96, 'Хацууме',     'Hatsuume',     '1945-06-18',  null,         null);


insert into ship_list
    (id, class_id, type_id, name_ru, name_en, commissioned, sunk_date, sunk_reason)
    values
    (334, 6, 60, 'Хибури',      'Hiburi',       '1944-06-27', '1944-08-22', 'торпедирован SS-257 Harder'),
    (335, 6, 60, 'Дайто',       'Daito',        '1944-08-07',  null,         null),
    (336, 6, 60, 'Сенан',       'Shonan',       '1944-07-13', '1945-02-25', 'торпедирован SS-258 Hoe, южнее острова Хайнань'),
    (337, 6, 60, 'Куме',        'Kume',         '1944-09-25', '1945-01-28', 'торпедирован SS-411 Spadefish, 33°54'' с.ш. 122°55'' в.д.'),
    (338, 6, 60, 'Икуна',       'Ikuna',        '1944-10-15',  null,         null),
    (339, 6, 60, 'Сисака',      'Shisaka',      '1944-12-15',  null,         null),
    (340, 6, 60, 'Сакито',      'Sakito',       '1945-01-10',  null,         null),
    (341, 6, 60, 'Мокуто',      'Mokuto',       '1945-02-19', '1945-04-04', 'подорвался на мине, Симоносекский пролив'),
    (342, 6, 60, 'Хабуто',      'Habuto',       '1945-04-07',  null,         null);


