
/*
бомбы 
    250кг тип 99
    60кг тип 97
    
*/
insert into bombs
    (id, name_ru, name_en, mass, mass_ex, in_service)
    values
    ( 0, 'No 6',                        'No 6',                      63.5,   null,   null), /* устарела в ходе войны */
    ( 1, 'тип 97 No 6',                 'type 97 No 6',              56,     23,     null), /* A6M7 */
    ( 2, 'тип 2 No 6 мод 5',            'type 2 No 6 mod 5',         60,     null,   null),
    ( 3, 'No 25',                       'No 25',                    250,    150,     null), /* разработана в 38; в начале войны производство прекращено */
    ( 4, 'тип 98 No 25',                'type 98 No 25',            241,     96,     '1938-01-01'), /* использовалась при Мидуэе */
    ( 5, 'No 80',                       'No 80',                    800,    382,     '1938-01-01'), /* использовалась при Мидуэе */
    ( 6, 'тип 99 No 25',                'type 99 No 25',            250,     60,     '1939-01-01'), /* A6M7 */
    ( 7, 'тип 2 No 50 мод 1',           'type 2 No 50 mod 1',       500,     67,     null),
    ( 8, 'No 80 мод 1',                 'No 80 mod 1',              830,    350,     null),
    ( 9, 'No 3 мод 2',                  'No 3 mod 2',                32,     null,   null), /* устарела в начале войны */
    (10, 'No 6 мод 2',                  'No 6 mod 2',                63,     29,     null), /* проиводилась до 1940-1941 */
    (11, 'No 25 мод 2',                 'No 25 mod 2',              253,    103,     null), /* использовалась при Мидуэе */
    (12, 'No 50 мод 2',                 'No 50 mod 2',              490,    207.5,   null),
    (13, 'тип 99 No 6 марк 2',          'type 99 No 6 mk 2',         64,     39,     null),
    (14, 'тип 1 No 25 марк 2 мод 1',    'type 1 No 25 mk 2 mod 1',  259,    144,     null),
    (15, 'тип 99 No 80 марк 5',         'type 99 No 80 mk 5',       744,     30,     '1941-01-01'),
    (16, 'тип 2 No 80 марк 5',          'type 2 No 80 mk 5',        800,     45,     '1942-01-01'),
    (17, 'тип 3 No 150 марк 5',         'type 3 No 150 mk 5',      1500,     91,     '1944-01-01'),
    (18, 'тип 3 No 25 марк 8 мод 1',    'type 3 No 25 mk 8 mod 1',  294,    119,     null),
    (19, 'тип 3 No 6 марк 23 мод 1',    'type 3 No 6 mk 23 mod 1',   65,     23,     null),
    (20, 'тип 3 No 25 марк 31 мод 1',   'type 3 No 25 mk 31 mod 1', 171,     79,     null),
    (21, 'тип 3 No 80 марк 31 мод 1',   'type 3 No 80 mk 31 mod 1', 718,    418,     null);
    

insert into aircraft_class
    (id, parent_id, name_ru, name_en)
    values
    (0, null,   'истребитель',                  'fighter'),         /* A */
    (1, null,   'торпедоносец',                 'torpedo bomber'),  /* B */
    (2, null,   'разведчик',                    'reconnaissance'),  /* C */
    (3, null,   'пикировщик',                   'dive bomber'),     /* D */
    (4, null,   'легкий бомбардировщик',        'light bomber'),
    (5, null,   'тяжелый бомбардировщик',       'heavy bomber'),
    (6, 2,      'гидросамолет разведчик',       'reconnaissance'),  /* E F */
    (7, 2,      'летающая лодка',               'flying boat'),     /* H */
    (8, 1,      'гидросамолет торпедоносец',    'torpedo bomber');  /* M */

 
insert into aircraft_types
    (id, name_ru, name_en)
    values
    (0,  'истребитель тип 0',               'Mitsubushi A6M Zero'),
    (1,  'торпедоносец тип 97',             'Nakajima B5N Kate'),
    (2,  'пикировщик тип 99',               'Aichi D3A Val'),
    (3,  'гидросамолет разведчик тип 0',    'Aichi E13A Jake'),
    (4,  'истребитель тип 96',              'Mitsubishi A5M Claude'),
    (5,  'пикировщик тип 2',                'Yokosuka D4Y Suisei (Judy)'),
    (6,  'гидросамолет разведчик тип 94',   'Kawanishi E7K Alf'),
    (7,  'гидросамолет разведчик тип 95',   'Nakajima E8N Dave'),
    (8,  'летающая лодка тип 97',           'Kawanishi H6K Mavis'),
    (9,  'гидросамолет патрульный тип 0',   'Mitsubishi F1M Pete'),
    (10, 'торпедоносец B6N',                'Nakajima B6N Tenzan'),
    (11, 'гидросамолет разведчик тип 90',   'Nakajima E4N'),
    (12, 'гидросамолет разведчик тип 96',   'Aichi E10A Hank'),
    (13, 'гидросамолет разведчик тип 98',   'Aichi E11A Laura'),
    (14, 'пикировщик тип 94',               'Aichi D1A Susie'),
    (15, 'разведчик тип 97',                'Nakajima C3N'),
    (16, 'истребитель A7M',                 'Mitsubishi A7M Reppu (Sam)'),
    (17, 'торпедоносец B7A Grace',          'Aichi B7A Ryusei'),
    (18, 'разведчик модель 11',             'Nakajima C6N Saiun (Myrt)'),
    (19, 'связной тип 3',                   'Ki-76 Stella'),
    (20, 'легкий бомбардировщик тип 93',    'Ki-3'),
    (21, 'гидросамолет разведчик тип 91',   'Yokosuka E6Y1'),
    (22, 'истребитель тип 10',              'Mitsubishi 1MF3'),
    (23, 'истребитель тип 3',               'Nakajima A1N1'),
    (24, 'гидросамолет разведчик тип 2',    'Kawanishi E151 Shiun (Norm)'),
    (25, 'гидросамолет разведчик тип 0',    'Yokosuka E14Y'),
    (26, 'гидросамолет торпедоносец M6A',   'Aichi M6A1 Seiran'),
    (27, 'гидросамолет разведчик W.33',     'Hansa Brandenburg W.33'),
    (28, 'гидросамолет разведчик тип 15',   'Nakajima E2N1'),
    (29, 'Спарроухаук',                     'Gloster Sparrowhawk'),
    (30, 'Пантер',                          'Parnall Panther'),
    (31, 'торпедоносец тип 92',             'Yokosuka B3Y'),
    (32, 'гидросамолет разведчик тип 14',   'Yokosuka E1Y'),
    (33, 'гидросамолет Йокошо',             'Yokosuka Ro-go Ko-gata'),
    (34, 'гидросамолет разведчик тип 96',   'Watanabe E9W'),
    (35, 'летающая лодка тип 91',           'Hiro H4H');


insert into aircraft_list
    (id, name_ru, name_en, class_id, type_id, crew, 
        mass, max_mass, engine_power, max_speed, cruise_speed,
        range, range_with_tank, ceiling, time_to_altitude, in_service)
    values
    (0,  'истребитель тип 0 модель 11',     'Mitsubushi A6M2 Zero',     0, 0, 1, /* 2* 7.7mm type 97, 2* 20mm type 99 */
     2360, 2800,     940,   533, 333,   1870, 3050, 10,     1.24,   '1940-07-01'),
    (1,  'истребитель тип 0 модель 32',     'Mitsubishi A6M3 Zero',     0, 0, 1, /* 2* 7.7mm type 97, 2* 20mm type 99 */
     2360, 3100,    1130,   544, 333,   1000, 2000, 10,     1.10,   '1942-04-01'),
    (2,  'истребитель тип 0 модель 52 Ко',  'Mitsubishi A6M5a Zero',    0, 0, 1, /* 2* 7.7mm type 97, 2* 20mm type 99 */
     2360, 3100,    1130,   565, 333,   1000, 2000, 10,     1.10,   '1943-09-01'),
    (3,  'истребитель тип 0 модель 52 Оцу', 'Mitsubishi A6M5b Zero',    0, 0, 1, /* 7.7mm type 97, 13.2mm type 3, 2* 20mm type 99 */
     2360, 3100,    1130,   565, 333,   1000, 2000, 10,     1.10,   '1944-04-01'),
    (4,  'истребитель тип 0 модель 52 Хей', 'Mitsubishi A6M5c Zero',    0, 0, 1, /* 3* 13.2mm type 3, 2* 20mm type 99 */
     2360, 3100,    1130,   565, 333,   1000, 2000, 10,     1.10,   '1944-10-01'),
    (5,  'истребитель тип 0 модель 63',     'Mitsubishi A6M7 Zero',     3, 0, 1, /* 3* 13.2mm type 3, 2* 20mm type 99 */ /* 250кг */ /*Камикадзе мог нести 500кг бомб*/
     null, null,    1130,   565, 333,   1000, 2000, 10,     1.10,   '1945-05-01'),
    (6,  'истребитель тип 0 модель 64',     'Mitsubishi A6M8 Zero',     0, 0, 1, /* 2* 13.2mm type 3, 2* 20mm type 99 */
     null, null,    1560,  null, null,  null, null, 10,     null,  null),

    (7,  'торпедоносец тип 97',             'Nakajima B5N1 Kate',       1, 1, 3, /* 7.7mm type 92 */ /* 1 торпеда || 800кг || 2* 250кг || 6* 60кг */
     2800, 4100,     840,   378, 250,   1000, null, 8.26,   2.55,   '1937-01-01'),
    (8,  'торпедоносец тип 97',             'Nakajima B5N2 Kate',       1, 1, 3, /* 7.7mm type 92 */ /* 1 торпеда || 800кг || 2* 250кг || 6* 60кг */
     2800, 4100,    1000,   378, 259,    978, null, 8.26,   2.55,   '1939-01-01'),

    (9,  'пикировщик тип 99 модель 11',     'Aichi D3A1 Val',           3, 2, 2, /* 2* 7.7mm type 97, 7.7mm type 92 (rear) */ /* 250кг || 2* 60кг */
     2400, 3900,    1000,   386, 296,   1630, 1820, 9.3,    2.15,   '1940-01-01'), 
    (10, 'пикировщик тип 99 модель 22',     'Aichi D3A2 Val',           3, 2, 2, /* 2* 7.7mm type 97, 7.7mm type 92 (rear) */ /* 250кг || 2* 60кг */
     2570, 4100,    1300,   430, 296,   1560, 2380, 10.5,   1.94,   '1942-06-01'),

    (11, 'гидросамолет разведчик тип 0',    'Aichi E13A Jake',          6, 3, 3, /* 7.7mm type 92 */ /* 250кг */
     3640, 4000,    1080,   375, 220,   2090, null, 8.73,   2.03,   '1940-12-01'),

    (12, 'истребитель тип 96 модель 1', 'Mitsubishi A5M1 Claude',       0, 4, 1, /* 2* 7.7mm type 97 */ /* 2* 30кг */
     1500, null,     580,   400, null,   700, 1200, 9.5,    1.3,    '1937-01-01'),
    (13, 'истребитель тип 96 модель 21','Mitsubishi A5M2a Claude',      0, 4, 1, /* 2* 7.7mm type 97 */ /* 2* 30кг */
     1600, null,     610,   420, null,   700, 1200, 9.5,    1.3,    '1937-01-01'),
    (14, 'истребитель тип 96 модель 22','Mitsubishi A5M2b Claude',      0, 4, 1, /* 2* 7.7mm type 97 */ /* 2* 30кг */
     1700, null,     640,   420, null,   700, 1200, 9.5,    1.3,    '1938-01-01'),
    (15, 'истребитель тип 96 модель 23','Mitsubishi A5M3 Claude',       0, 4, 1, /* 2* 7.7mm type 97 */ /* 2* 30кг */
     1700, null,     610,   420, null,   700, 1200, 9.5,    1.3,    '1938-01-01'),
    (16, 'истребитель тип 96 модель 24','Mitsubishi A5M4 Claude',       0, 4, 1, /* 2* 7.7mm type 97 */ /* 2* 30кг */
     1700, null,     710,   430, null,   650, 1200, 9.5,    1.3,    '1939-01-01'),

    (17, 'разведчик тип 2 модель 11',   'Yokosuka D4Y1-C Suisei (Judy)',    2, 5, 2, /* 3* 7.7mm type 97 */
     2500, 4000,    1200,   550, 426,   1800, 2200, 10.7,   1.61,   '1942-01-01'),
    (18, 'пикировщик тип 2 модель 11',  'Yokosuka D4Y1 Suisei (Judy)',      3, 5, 2, /* 3* 7.7mm type 97 */ /* 500кг */
     2500, 4000,    1200,   550, 426,   1800, 2200, 10.7,   1.61,   '1943-07-01'),
    (19, 'пикировщик тип 2 модель 21',  'Yokosuka D4Y1 KAI Suisei (Judy)',  3, 5, 2, /* 3* 7.7mm type 97 */ /* 500кг */
     2500, 4000,    1200,   550, 426,   1800, 2200, 10.7,   1.61,   '1944-03-17'), /* Исе Хюга */
    (20, 'пикировщик тип 2 модель 12',  'Yokosuka D4Y2 Suisei (Judy)',      3, 5, 2, /* 3* 7.7mm type 97 */ /* 500кг */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-05-01'),
    (21, 'пикировщик тип 2 модель 12a', 'Yokosuka D4Y2a Suisei (Judy)',     3, 5, 2, /* 2* 7.7mm type 97, 13.2mm type 3 (rear) */ /* 500кг */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-10-01'),
    (22, 'истребитель тип 2 модель 12e','Yokosuka D4Y2-S Suisei (Judy)',    0, 5, 2, /* 2* 7.7mm type 97, 13.2mm type 3 (rear), 20mm type 99 */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-10-01'),
    (23, 'пикировщик тип 2 модель 22',  'Yokosuka D4Y2 KAI Suisei (Judy)',  3, 5, 2, /* 3* 7.7mm type 97 */ /* 500кг */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-10-01'), /* Исе Хюга */
    (24, 'пикировщик тип 2 модель 22a', 'Yokosuka D4Y2a KAI Suisei (Judy)', 3, 5, 2, /* 2* 7.7mm type 97, 13.2mm type 3 (rear) */ /* 500кг */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-11-01'), /* Исе Хюга */
    (25, 'разведчик тип 2 модель 12',   'Yokosuka D4Y2-R Suisei (Judy)',    2, 5, 2, /* 3* 7.7mm type 97 */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-05-01'),
    (26, 'разведчик тип 2 модель 12a',  'Yokosuka D4Y2a-R Suisei (Judy)',   2, 5, 2, /* 3* 7.7mm type 97, 13.2mm type 3 (rear) */
     2600, 4400,    1400,   580, 426,   1500, 2390, 10.7,   1.19,   '1944-10-01'),
    (27, 'пикировщик тип 2 модель 33',  'Yokosuka D4Y3 Suisei (Judy)',      3, 5, 2, /* 3* 7.7mm type 97 */ /* 500кг */
     2500, 4700,    1560,   580, 426,   1500, 2275, 10.7,   1.19,   '1944-08-01'),
    (28, 'истребитель тип 2 модель 33e','Yokosuka D4Y3-S Suisei (Judy)',    0, 5, 2, /* 2* 7.7mm type 97, 13.2mm type 3 (rear), 20mm type 99 */
     2500, 4700,    1560,   580, 426,   1500, 2275, 10.7,   1.19,   '1944-11-01'),
    (29, 'пикировщик тип 2 модель 43',  'Yokosuka D4Y4 Suisei (Judy)',      3, 5, 2, /* 2* 7.7mm type 97, 13.2mm type 3 (rear) */ /* 800кг */
     2500, 4700,    1560,   580, 426,   1500, 2275, 10.7,   1.19,   '1945-02-01');


insert into aircraft_list
    (id, name_ru, name_en, class_id, type_id, crew, 
        mass, max_mass, engine_power, max_speed, cruise_speed,
        range, range_with_tank, ceiling, time_to_altitude, in_service)
    values
    (30, 'гидросамолет разведчик тип 94 модель 1',  'Kawanishi E7K1 Alf',   6, 6, 3, /* 2* 7.7mm type 92 */
     2100, 3300,     520,   276, 185,   2463, null, 7,      3,      '1934-06-01'),
    (31, 'гидросамолет разведчик тип 94 модель 2',  'Kawanishi E7K2 Alf',   6, 6, 3, /* 2* 7.7mm type 92, 7.7mm type 97*/ /* 2* 60кг */
     2100, 3300,     850,   276, 185,   2463, null, 7,      3,      '1938-08-01'),

    (32, 'гидросамолет разведчик тип 95 модель 1',  'Nakajima E8N1 Dave',   6, 7, 2, /* 7.7mm type 97, 7.7mm type 92 */
     1320, 1900,     585,   301, 186,    898, null, 7.2,    2.17,   '1935-10-01'),
    (33, 'гидросамолет разведчик тип 95 модель 2',  'Nakajima E8N2 Dave',   6, 7, 2, /* 7.7mm type 97, 7.7mm type 92 */ /* 2* 30кг */
     1320, 1900,     630,   301, 186,    898, null, 7.2,    2.17,   '1938-01-01'),

    (34, 'летающая лодка тип 97 модель 11',         'Kawanishi H6K2 Mavis', 7, 8, 9, /* 20mm type 99, 4* 7.7mm type 97 */ /* 2 торпеды || 1000кг бомб */
     17000, 21500,  4000,   340, 222,   4797, null, 9.6,    2.68,   '1938-01-01'),
    (35, 'летающая лодка тип 97 модель 22',         'Kawanishi H6K4 Mavis', 7, 8, 9, /* 20mm type 99, 4* 7.7mm type 97 */ /* 2 торпеды || 1000кг бомб */
     17000, 21500,  3720,   340, 222,   6600, null, 9.6,    2.68,   '1940-01-01'),
    (36, 'летающая лодка тип 97 модель 23',         'Kawanishi H6K5 Mavis', 7, 8, 9, /* 20mm type 99, 4* 7.7mm type 97 */ /* 2 торпеды || 1000кг бомб */
     17000, 21500,  5200,   340, 222,   6600, null, 9.6,    2.68,   '1941-01-01'),

    (37, 'гидросамолет патрульный тип 0 модель 11', 'Mitsubishi F1M2 Pete', 6, 9, 2, /* 3* 7.7mm type 97, 7.7mm type 92 */ /* 2* 60кг || 250кг камикадзе */
     2550, 2856,     875,   365, 287,    730, null, 9.4,    1.94,   '1940-01-01'),

    (38, 'торпедоносец B6N модель 11',          'Nakajima B6N1 Tenzan',     1, 10, 3, /* 2* 7.7mm type 92 */ /* 1 торпеда || 800кг || 2* 250кг */
     5200, 5650,    1870,   482, 333,   1746, null, 8.6,    2.19,   '1943-01-01'),
    (39, 'торпедоносец B6N модель 12',          'Nakajima B6N2 Tenzan',     1, 10, 3, /* 2* 7.7mm type 92 */ /* 1 торпеда || 800кг || 2* 250кг */ /* РЛС type 3 с осени 1943*/
     5200, 5650,    1850,   482, 333,   1746, null, 8.6,    2.19,   '1943-06-01'),
    (40, 'торпедоносец B6N модель 12a',         'Nakajima B6N2a Tenzan',    1, 10, 3, /* 7.7mm type 92, 12.7mm HO-103 */ /* 1 торпеда || 800кг || 2* 250кг */
     5200, 5650,    1850,   482, 333,   1746, null, 8.6,    2.19,   '1943-06-01'),

    (77, 'гидросамолет разведчик тип 90-2-1',   'Nakajima E4N1',    6, 11, 2, /* 2* 7.7mm Vickers */
     1800, 1800,     585,   228, 146,   1000, null, 5.7,    5.86,   '1931-01-01'),
    (41, 'гидросамолет разведчик тип 90-2-2',   'Nakajima E4N2',    6, 11, 2, /* 2* 7.7mm Vickers */
     1800, 1800,     585,   228, 146,   1000, null, 5.7,    5.86,   '1931-01-01'),
    (42, 'гидросамолет разведчик тип 90-2-3',   'Nakajima E4N3',    6, 11, 2, /* 2* 7.7mm type 92 */ /* 2* 30кг */
     1800, 1800,     585,   228, 146,   1000, null, 5.7,    5.86,   '1933-01-01'),

    (43, 'гидросамолет разведчик тип 96',       'Aichi E10A Hank',  6, 12, 3, /* 7.7mm type 87 */
     3300, 3300,     500,   206, 106,   1852, null, 4.1,    5.9,    '1936-01-01'),

    (44, 'гидросамолет разведчик тип 98',       'Aichi E11A Laura', 6, 13, 3, /* 7.7mm type 92 */
     3297, 3297,     620,   217, 135,   1945, null, 4.4,    6.0,    '1938-01-01'),

    (45, 'пикировщик тип 94',   'Aichi D1A1 Susie',                 3, 14, 2, /* 3* 7.7mm type 92 */ /* 250кг, 2* 30кг */
     2500, 2610,     730,   309, 222,    926, null, 6.98,   2.61,   '1934-01-01'),
    (46, 'пикировщик тип 96',   'Aichi D1A2 Susie',                 3, 14, 2, /* 3* 7.7mm type 92 */ /* 250кг, 2* 30кг */
     2500, 2610,     820,   309, 222,    926, null, 6.98,   2.59,   '1936-01-01'),

    (47, 'разведчик тип 97',    'Nakajima C3N1',                    2, 15, 3, /* 2* 7.7mm type 92 */
     3000, 3000,     840,   387, 300,   2262, null, 6.67,   null,   '1937-09-01'),

    (48, 'истребитель A7M',     'Mitsubishi A7M2 Reppu (Sam)',      0, 16, 1, /* 2* 20mm type 99, 2* 13.2mm type 3 */ /* 2* 250кг */
     3200, 4700,    2200,   620, 417,   2000, null, 11,     1.02,   '1944-06-01'),
    (49, 'истребитель A7M',     'Mitsubishi A7M2 Reppu (Sam)',      0, 16, 1, /* 4* 20mm type 99 */ /* 2* 250кг */
     3200, 4700,    2200,   620, 417,   2000, null, 11,     1.02,   '1944-06-01'),
    (50, 'истребитель A7M',     'Mitsubishi A7M3 Reppu (Sam)',      0, 16, 1, /* 6* 20mm type 99 */ /* 2* 250кг */
     3400, 5000,    2300,   640, 417,   2000, null, 11,     1.02,   '1944-07-01'),

    (51, 'торпедоносец B7A Grace',  'Aichi B7A2 Ryusei',            1, 17, 2, /* 2* 20mm type 99, 13.2mm type 3 */ /* 1 торпеда || 800кг */
     5625, 6500,    1825,   567, null,  3038, null, 11.25,  1.73,   '1944-03-01');


insert into aircraft_list
    (id, name_ru, name_en, class_id, type_id, crew, 
        mass, max_mass, engine_power, max_speed, cruise_speed,
        range, range_with_tank, ceiling, time_to_altitude, in_service)
    values
    (52, 'разведчик модель 11',     'Nakajima C6N1 Saiun (Myrt)',   2, 18, 3, /* 13.2mm type 3 */ /* 1 торпеда || 800кг*/
     4500, 5260,    1991,   610, 390,   2600, null, 10.4,   1.35,   '1944-01-01'),
    (53, 'истребитель модель 11',   'Nakajima C6N1-S Saiun (Myrt)', 0, 18, 2, /* 2* 20mm type 99 */
     4500, 5260,    1991,   610, 390,   2600, null, 10.4,   1.35,   '1944-10-01'),
    (54, 'разведчик модель 12',     'Nakajima C6N2 Saiun (Myrt)',   2, 18, 3, /* 13.2mm type 3 */ /* 1 торпеда || 800кг*/
     4500, 5260,    1980,   610, 390,   2600, null, 10.4,   1.35,   '1944-01-01'),

    (55, 'связной тип 3',                   'Ki-76 Stella',         2, 19, 2, /* 7.7mm type 92 */ /* 2* 60 depth charges */
     1530, 1623,     310,   178, null,   750, null, 5.6,    null,   '1943-01-01'),

    (56, 'легкий бомбардировщик тип 93',    'Ki-3',                 4, 20, 2, /* 2* 7.7mm type 89 */ /* 500кг */
     3097, 3097,     790,   259, 230,   null, null, 7,      null,   '1934-01-01'),

    (57, 'гидросамолет разведчик тип 91',   'Yokosuka E6Y1',        6, 21, 2, /* none */
      750,  760,     160,   186, 138,    600, null, 4.8,    6.7,    '1933-01-01'),

    (58, 'истребитель тип 10-2',    'Mitsubishi 1MF3',  0, 22, 1, /* 2* 7.7mm */
      940, 1280,     300,   213, null,  1014, null, 7.9,    3.3,    '1923-01-01'), /* Хосе Акаги Кага  Кисо 1922 (испытания) */
    (59, 'истребитель тип 10-2',    'Mitsubishi 1MF4',  0, 22, 1, /* 2* 7.7mm */
      940, 1280,     300,   213, null,  1014, null, 7.9,    3.3,    '1923-01-01'),
    (60, 'истребитель тип 10-2',    'Mitsubishi 1MF5',  0, 22, 1, /* 2* 7.7mm */
      940, 1280,     300,   213, null,  1014, null, 7.9,    3.3,    '1923-01-01'),

    (61, 'истребитель тип 3',       'Nakajima A1N1',    0, 23, 1, /* 2* 7.7mm */ /* 2* 30кг */
      882, 1375,     420,   241, 148,    370, null, 7,      2.0,    '1929-01-01'),
    (62, 'истребитель тип 3',       'Nakajima A1N2',    0, 23, 1, /* 2* 7.7mm */ /* 2* 30кг */
      882, 1375,     450,   241, 148,    370, null, 7,      2.0,    '1930-01-01'),

    (63, 'гидросамолет разведчик тип 2 модель 11',  'Kawanishi E15K1 Shiun (Norm)',  6, 24, 2, /* 7.7mm type 92 */
     4100, 4900,    1850,   460, 290,   3320, null, 9.8,    1.66,   '1942-10-01'),

    (64, 'гидросамолет разведчик тип 0',    'Yokosuka E14Y',        6, 25, 2, /* 7.7mm type 92 */ /* 2* 76кг */
     1500, 1600,     340,   250, 160,    900, null, 5.5,    3.33,   '1941-01-01'),

    (65, 'гидросамолет торпедоносец M6A',   'Aichi M6A1 Seiran',    8, 26, 1, /* 12.7mm HO-103 */ /* 1 торпеда || 850кг || 2* 250кг */
     4040, 4445,    1400,   474, 296,   1188, null, 9.9,    1.93,   '1945-01-01'),

    (66,  'гидросамолет разведчик W.33',    'Hansa Brandenburg W.33',   6, 27, 2, /* 2+1* 7.92mm */
     2050, 2050,    210, 173, 158,  600, null,  4.8, 6.3,  '1921-06-01'), /* Конго [1922, 1927]  Нагато [1926, ] */

    (67,  'гидросамолет разведчик тип 15',  'Nakajima E2N1',            6, 28, 2, /* 7.7mm type 92 */
     1950, 1950,    300, 172, 138,  640, null,  5.4, 10.5, '1927-01-01'), /* Конго [1927, ] */

    (68, 'Спарроухаук 1',       'Sparrowhawk 1',    0, 29, 1, /* 2* 7.7mm vickers */
      982,  982,    230,    201, null,  600, null,  5.2,     5.5,   '1921-01-01'), /* Кисо 1921 (испытания) */

    (69, 'Пантер',              'Panther',          2, 30, 2, /* 7.7mm Lewis */
     1177, 1177,    230,    174, null,  770, null,  4.4,     3.8,   '1919-01-01'), /* Кисо 1921 (испытания) */

    (70, 'торпедоносец тип 92', 'Yokosuka B3Y1',    1, 31, 3, /* 2* 7.7mm */ /* 800кг торпеда || 500кг бомб */
     3200, 3200,    600,    219, null,  900, null,  null, null,     '1933-01-01'),

    (71, 'гидросамолет разведчик тип 14-1', 'Yokosuka E1Y1',    6, 32, 2, /* 7.7mm */ /* 2* 100кг бомб */
     2750, 2750,    400,    178, 130,   1156, null, 4,      9.4,    '1926-01-01'),
    (72, 'гидросамолет разведчик тип 14-2', 'Yokosuka E1Y2',    6, 32, 3, /* 7.7mm */ /* 2* 100кг бомб */
     2750, 2750,    451,    178, 130,   1156, null, 4,      9.4,    '1926-01-01'), /* Юра [1926-1927]  Абукума [1926-1927] */
    (76, 'гидросамолет разведчик тип 14-3', 'Yokosuka E1Y3',    6, 32, 3, /* 7.7mm */ /* 2* 100кг бомб */
     2750, 2750,    451,    178, 130,   1156, null, 4,      9.4,    '1931-01-01'), /* Конго [1931 ] */

    (73, 'гидросамолет Йокошо', 'Yokosuka Ro-go Ko-gata',       6, 33, 2, /* 7.7mm */ 
     1628, 1628,    220,    156, null,  780, null,  null,   8.0,    '1918-01-01'), /* Нагато [III.1925 I.1926] испытания */

    (74, 'гидросамолет разведчик тип 96',   'Watanabe E9W1',    6, 34, 2, /* 7.7mm */
     1253, 1253,    300,    232, 148,   731, null,  6.7,    null,   '1938-01-01'), /* подводные лодки */

    (75, 'летающая лодка тип 91',           'Hiro H4H',         7, 35, 6, /* 3* 7.7mm */ /* 2* 250кг */
     7500, 7500,   1600,    233, null,  1260, null, 3.6,    null,   '1933-01-01');

