    
/* котлы */
insert into boiling_types
    (id, name_ru, name_en, value, temperature, pressure, heating_surface)
    values
    ( 0, 'Кампон Ро Го',                'Kampon Ro Go large',           2,  300,      22,    917), /* 8* Могами, Микума */
    ( 1, 'Кампон Ро Го малый',          'Kampon Ro Go small',           2,  300,      22,    757), /* 2* Могами, Микума */
    ( 2, 'Кампон Ро Го',                'Kampon Ro Go large',           2,  300,      22,   1107), /* 8* Судзуя, Кумано, тип Тоне, тип Сорю */
    
    ( 3, 'Кампон Ро Го',                'Kampon Ro Go',                 2,  100,      20,    970), /* 12* тип Такао, тип Меко */
    ( 4, 'Кампон Ро Го',                'Kampon Ro Go donkey',          2,  100,      14,     61), /*  2* тип Такао */
    
    ( 5, 'Кампон Ро Го большой',        'Kampon Ro Go large',           2,  156,    18.3,   null), /* 2* тип Аоба, тип Фурутака */
    ( 6, 'Кампон Ро Го средний',        'Kampon Ro Go medium',          2,  156,    18.3,   null), /* 8* тип Аоба, тип Фурутака */
    ( 7, 'Кампон Ро Го малый',          'Kampon Ro Go small',           3,  156,    18.3,   null), /* 2* тип Аоба, тип Фурутака */

    
    ( 8, 'Кампон Ро Го',                'Kampon Ro Go',                 2,  350,      30,    981), /*  6* Оедо */
    ( 9, 'Кампон Ро Го',                'Kampon Ro Go',                 2,  350,      30,    889), /*  6* тип Агано */
    (10, 'Кампон Ро Го',                'Kampon Ro Go',                 2,  100,    18.3,   null), /* 12* тип Кума, 
                                                                                                      12* Нагара, Исудзу, Натори, Юра, Абукума, 
                                                                                                      12* Сендай, Нака */
    (11, 'Кампон Ро Го',                'Kampon Ro Go',                 2,  156,    18.3,   null), /* 12* Кину, Дзинцу */
    
    (12, 'Кампон Ро Го малый',          'Kampon Ro Go small',           2,  156,    18.3,   null), /*  2* тип Тенрю */
    (13, 'Кампон Ро Го большой',        'Kampon Ro Go large',           2,  156,    18.3,   null), /*  6* тип Тенрю */
    (14, 'Кампон Ро Го',                'Kampon Ro Go',                 3,  156,    18.3,   null), /*  2* тип Тенрю */
    
    (15, 'Кампон Ро Го малый',          'Kampon Ro Go small',           2,  156,    18.3,   null), /*  2* Юбари */
    (16, 'Кампон Ро Го большой',        'Kampon Ro Go large',           2,  156,    18.3,   null), /*  6* Юбари */

    (17, 'Кампон Хо Го',                'Kampon Ho Go',                 2,  280,      20,   null), /*  2* тип Катори */
    
    
    (18, 'Кампон Ро Го',                'Kampon Ro Go large',           2,  270,    19.5,   null), /* 11* Акаги до 1938, 8* Кага до 1934 */
    (19, 'Кампон Ро Го малый',          'Kampon Ro Go small',           1,  270,    19.5,   null), /*  8* Акаги до 1938, 4* Кага до 1934 */
    
    (20, 'Кампон Ро Го',                'Kampon Ro Go large',           2,  310,      23,   null), /* 11* Акаги после 1938, 8* Кага после 1936 */
    (21, 'Кампон Ро Го малый',          'Kampon Ro Go small',           2,  310,      23,   null), /*  8* Акаги после 1938 */
    
    (25, 'Кампон Ро Го',                'Kampon Ro Go large',           2,  270,    19.4,   null), /*  4* Рюдзе, тип Фубуки */
    (26, 'Кампон Ро Го малый',          'Kampon Ro Go small',           2,  270,    19.4,   null), /*  2* Рюдзе, тип Фубуки */
    
    (27, 'Кампон Ро Го',                'Kampon Ro Go large',           2,  352,      30,   null), /*  8* тип Секаку, 8* Тайхо */
    
    (29, 'Кампон Ро Го',                'Kampon Ro Go large',           2,  300,      22,   null), /*  4* Кайе, 8* Унрю, 8* Амаги */
    (30, 'Кампон Ро Го',                'Kampon Ro Go large',           2,  350,      30,   null), /*  3* тип Кагеро (кроме Амацукадзе), 3* тип Югумо, 4* тип Дзуйхо, 4* Рюхо, 8* Кацураги */
    (31, 'Кампон Ро Го',                'Kampon Ro Go',                 2,  280,      22,   null), /*  4* тип Титосе */
    (32, 'Кампон Ро Го No 38 мод 17',   'Kampon Ro Go No 38 mod 17',    2,  350,      30,   null), /*  3* тип Акидзуки */
    
    (33, 'Schichau',                    'Schichau',                     2,  400,      32,   null), /*  4* Синье */

    (34, 'Кампон Ро Го',                'Kampon Ro Go large',           2,  350,      25,   null), /*  4* тип Тайе */
    
    (35, 'Кампон Ро Го',                'Kampon Ro Go',                 1,  138,    18.3,   null), /*  4* Хосе */
    (36, 'Кампон Ро Го',                'Kampon Ro Go',                 3,  138,    18.3,   null), /*  4* Хосе */
    
    (37, 'Мицубиси',                    'Mitsubishi',                   2,  420,      40,   null), /*  6* Дзюнье */
    (38, 'Кавасаки-LaMont',             'Kawasaki-LaMont',              2,  420,      40,   null), /*  6* Хие */
    
    
    (39, 'Кампон Ро Го',                'Kampon Ro Go',                 2,  325,      25,   null), /* 12* тип Ямато */
    
    (40, 'Yarrow',                      'Yarrow',                       3,  270,      19,   null), /* 36* Конго, Хией, Кирисима до 1929, Харуна до 1924
                                                                                                      11* Хией с 1933 по 1936 */
    (41, 'Кампон Ро Го большой',        'Kampon Ro Go large',           3,  320,      25,   null), /*  6* Конго с 1931 по 1935, Кирисима с 1931 по 1934 */
    (42, 'Кампон Ро Го малый',          'Kampon Ro Go small',           2,  320,      25,   null), /*  4* Конго с 1931 по 1935, Кирисима с 1931 по 1934 */
    (43, 'Кампон Хо-Го большой',        'Kampon Ho-Go large',           3,  370,    22.5,   null), /*  6* Харуна с 1928 по 1933 */
    (44, 'Кампон Хо-Го малый',          'Kampon Ho-Go small',           3,  370,    22.5,   null), /* 10* Харуна с 1928 по 1933 */
    (45, 'Кампон Ро-Го большой',        'Kampon Ro-Go large',           2, null,    null,   null), /*  6* Харуна после 1934 */
    (46, 'Кампон Ро-Го малый',          'Kampon Ro-Go small',           2, null,    null,   null), /*  5* Харуна после 1934 */
    (47, 'Кампон Ро Го большой',        'Kampon Ro Go large',           2,  320,      25,   null), /*  8* Конго после 1937, Хией после 1940, Кирисима после 1936 */
    
    (48, 'Маяхара',                     'Miyahara',                     3,  270,      19,   null), /* 24* Фусо, Ямасиро до 1930 */
    (49, 'Кампон Хо Го',                'Kampon Ho Go',                 2,  320,      25,   null); /*  6* Фусо после 1932, Ямасиро после 1935 */
    
    
