
insert into catapult_class
    (id, name_ru, name_en)
    values
    (0, 'платформа',                    'platform'),
    (1, 'катапульта на сжатом воздухе', 'catapult on compressed air'),
    (2, 'катапульта пороховая',         'catapult powder'),
    (3, 'катапульта пружинная',         'catapult spring');

insert into catapult
    (id, name_ru,               name_en,       class_id, length, width, speed, launch_mass, alleceration, in_service)
    values
    (0,   null,                  null,              0,     19,      null,   0,      null,       0,      '1921-10-01'), /* Ямасиро [01.1921 - 05-1922] */
    (1,   null,                  null,              0,     null,    null,   0,      null,       0,      '1921-05-01'), /* Кисо [05.1922 - 05.1922] */
    (2,   null,                  null,              0,     10,      null,   0,      null,       0,      '1922-01-01'), /* Нагара*  Сендай* */
    (3,   null,                  null,              0,     18,      null,   0,      null,       0,      '1925-01-01'), /* Нагато [III.1925 I.1926] */
    (4,  'экспериментальная',   'experimental',     3,     null,    null,   null,   null,       null,   '1926-01-01'), /* Юра [04.1930 10.1930] */
    (5,  'Куре No 1 мод 1',     'Kure No 1 mod 1',  1,     19.4,    1.2,    26,     2000,       2.5,    '1928-05-01'), /* Аоба* [1929 1930]  Меко* [1929 1935] */
    (6,  'Куре No 2 мод 1',     'Kure No 2 mod 1',  2,     19.4,    1.2,    26,     2000,       2.5,    '1929-01-01'), /* Аоба* [1930 1940] Меко* [1935 ] */
    (7,  'Куре No 2 мод 2',     'Kure No 2 mod 2',  2,     17.0,    1.2,    26,     1700,       2.5,    '1930-10-26'), /* Юра 10.1930  Кину 10.1930  Дзинцу 11.1931 */
    (8,  'Куре No 2 мод 3',     'Kure No 2 mod 3',  2,     19.4,    1.2,    28,     3000,       2.7,    '1932-03-30'), /* Конго Кирисима Харуна 
                                                                                                                          Ямасиро 
                                                                                                                          Исе Хюга 
                                                                                                                          Нагато Муцу
                                                                                                                          Такао* 
                                                                                                                          Могами
                                                                                                                          Меко
                                                                                                                          Фурутака
                                                                                                                          Кума Тама 
                                                                                                                          Нагара Натори Кину Исудзу Юра Абукума
                                                                                                                          Сендай Дзинцу Нака */
    (9,  'Куре No 2 мод 4',     'Kure No 2 mod 4',  2,     17.4,    1.2,    28,     3000,       2.7,    '1933-05-12'), /* Фусо */
    (10, 'Куре No 2 мод 5',     'Kure No 2 mod 5',  2,     19.4,    1.2,    28,     4000,       2.7,    '1938-10-21'), /* Аоба 1940  Кинугаса 1940
                                                                                                                          Могами*
                                                                                                                          Тоне*
                                                                                                                          Катори*
                                                                                                                          Яхаги Сакава
                                                                                                                          Оедо 03.1944
                                                                                                                          Мидзухо
                                                                                                                          Титосе Тиеда
                                                                                                                          Тайгей */
    (11, 'тип 0 No 2 мод 11',   'Zero No 2 mod 11', 2,     25.6,    1.2,    32,     5000,       2.7,    '1941-01-01'), /* Ямато Мусаси
                                                                                                                          Исе 1944  Хюга 1944 
                                                                                                                          Ниссин */
    (12, 'Куре No 1 мод 2',     'Kure No 1 mod 2',  1,     null,    null,   null,   1200,      null,    '1933-07-15'), /* I-51 05.1933 испытания  I-5  */
    (13, 'Куре No 1 мод 3',     'Kure No 1 mod 3',  1,     null,    null,   null,   1200,      null,     null),        /* I-6  I-7 */
    (14, 'Куре No 1 мод 4',     'Kure No 1 mod 4',  1,     19.0,    0.9,    26,     1600,       2.5,    '1939-01-01'), /* I-15  I-8  I-9 */
    (15, 'тип 2 No 1 мод 10',   'Ni No 1 mod 10',   1,     44.0,    1.5,    36,     5000,       2.5,    '1942-01-01'), /* Оедо [ 03.1944] */
    (16, 'тип 4 No 1 мод 10',   'Shi No 1 mod 10',  1,     26.0,    1.3,    34,     5000,       2.5,    '1944-01-01'); /* I-14*  I-400* */


