
/* http://www.combinedfleet.com/radar.htm */
/* https://pwencycl-kgbudge-com.translate.goog/R/a/Radar.htm?_x_tr_sch=http&_x_tr_sl=en&_x_tr_tl=ru&_x_tr_hl=ru&_x_tr_pto=op,sc */
/* http://home.e01.itscom.net/ikasas/catalog/catalog.htm */
/* http://home.e01.itscom.net/ikasas/radar/jprdf03.htm#type_13 */
insert into searchers
    (id, name_ru,           name_en,        class_id,    mass,  frequency,   power, build_cnt,    in_service)
    values
    ( 0, 'РЛС тип 21',      'radar type 21',    8,       840,       200,        5,   40,        '1942-01-01'), /* корабельный
                                                                                                                  Исе, Хюга [04.1942 ]
                                                                                                                  Тайе, Унье, Тюе [01.1943 ]
                                                                                                                  Аоба
                                                                                                                  Меко Нати Асигара Хагуро
                                                                                                                  Такао Атаго Текай Мая 
                                                                                                                  Тоне Тикума
                                                                                                                  Носиро Яхаги Сакава
                                                                                                                  Дзуйкаку
                                                                                                                  Татибана*
                                                                                                                  другие до [08.1943 ] */
    ( 1, 'РЛС тип 22',      'radar type 22',    8,      1320,      3000,        2,  300,        '1942-01-01'), /* корабельный
                                                                                                                  для подводных лодок 
                                                                                                                  Кадзагумо, Макигумо [03.1942 ] 
                                                                                                                  Хамакадзе [06.1942 ]
                                                                                                                  Акигумо, Югумо [07.1942 ]
                                                                                                                  Конго, Харуна [10.1942 ]
                                                                                                                  Хюга [10.1942 ] по другим данным [03.1942 ]
                                                                                                                  Катори, Касима, Касии [06.1943 ]
                                                                                                                  Ямато, Мусаси [10.1943 ]
                                                                                                                  другие эсминцы до [09.1944 ]*/
    ( 2, 'РЛС тип 13',      'radar type 13',    8,       110,       150,       10, 1000,        '1942-06-01'), /* наземный
                                                                                                                  корабельный */
    ( 3, 'РЛС тип 11',      'radar type 11',    8,      8700,       100,       40,   30,        '1943-06-01'), /* наземный, фиксированный */
    ( 4, 'РЛС тип 12',      'radar type 12',    8,      6000,       200,        5,   50,        '1944-04-01'), /* наземный, перемещаемый  */
    ( 5, 'РЛС тип 14',      'radar type 14',    8,     30000,        50,      100,    2,        '1945-05-01'), /* наземный, фиксированный */
    ( 6, 'РЛС тип H-6',     'radar type H-6',  14,       110,       150,        3, 2000,        '1942-08-01'), /* авиационный 
                                                                                                                  H8K
                                                                                                                  G4M2 */
    ( 7, 'РЛС тип FM-1',    'radar type FM-1', 14,        70,       150,       42, null,        '1944-09-01'), /* авиационный
                                                                                                                  4-моторные самолеты */
    ( 8, 'РЛС тип N-6',     'radar type N-6',  14,        60,       250,        2,   20,        '1944-10-01'), /* авиационный
                                                                                                                  одномоторные 3-местные самолеты */
    ( 9, 'РЛС тип FM-3',    'radar FM-3',      14,        60,       150,        2,  100,        '1945-06-01'), /* авиационный
                                                                                                                  одномоторные 3-местные самолеты */
    (10, 'РЛС тип 41',      'radar type 41',    8,      5000,       200,       13,   50,        '1943-08-01'), /* наземный для батарей ПВО */
    (11, 'РЛС тип 42',      'radar type 42',    8,      5000,       200,       13,   60,        '1944-10-01'), /* наземный для батарей ПВО */
    (12, 'РЛС тип 43',      'radar type 43',    8,       500,       200,       13,  121,        '1945-07-01'), /* наземный */
    (13, 'РЛС тип 23',      'radar type 23',    8,      1000,       500,        5, null,        '1944-03-01'), /* корабельный ( >= крейсера) для батарей ГК */
    (14, 'РЛС тип 31',      'radar type 31',    8,      1000,      3000,        2, null,        '1945-03-01'), /* корабельный ( >= крейсера) для батарей ГК
                                                                                                                  наземный для береговых батарей */
    (15, 'РЛС тип 32',      'radar type 32',    8,      5000,      3000,        2,   60,        '1944-09-01'), /* корабельный (тяжелые крейсера, линкоры) для батарей ГК 
                                                                                                                  наземный для береговых батарей */
    (16, 'РЛС тип 33',      'radar type 33',    8,       800,      3000,        2, null,        '1944-08-01'), /* корабельный для батарей ГК */
    (17, 'РЛС FD-2',        'radar FD-2',      14,        70,       500,       25,  100,        '1944-08-01'), /* авиационный
                                                                                                                  ночные бомбардировщики */
    (18, 'РЛС TAMA3',       'radar TAMA3',     14,        70,       150,        3,   10,        '1945-07-01'), /* авиационный
                                                                                                                  ночные бомбардировщики */
    (19, 'РЛС тип 61',      'radar type 61',    8,     15000,       500,       10,    1,        '1945-04-01'), /* наземный */
    (20, 'РЛС тип 62',      'radar type 62',    8,      3000,       150,       10,    1,        '1945-06-01'), /* наземный */
    (21, 'РЛС тип 63',      'radar type 63',    8,      8700,       100,       40,    1,         null       ), /* наземный */ 
    (22, 'РЛС TH',          'radar TH',         8,       500,       200,       13, null,        '1945-07-01'), /* береговые сооружения */
    (23, 'РЛС M-13',        'radar M-13',      14,        10,       150,     0.05,  100,        '1945-06-01'), /* авиационный */
    (24, 'РЛС тип 51',      'radar type 51',   14,       200,      3000,        6, null,         null       ), /* авиационный для навигации
                                                                                                                  4-моторные бомбардировщики */
    (25, 'РЛС FH-1',        'radar FH-1',      14,        30,       341,   0.0001,  100,        '1945-02-01'), /* авиационный высотомер
                                                                                                                  летающие лодки */
    (26, 'ндикатор ЭМИ E27','indicator ESM E27',8,        40,       400,     null, 2500,        '1944-03-01'), /* корабельный
                                                                                                                  торпедные катера */
    (27, 'РЛС FT-B',        'radar FT-B',      14,        25,       666,     null,  300,        '1944-05-01'), /* авиационный
                                                                                                                  бомбардировщики и разведчики */
    (28, 'РЛС FT-C',        'radar FT-C',      14,        20,       666,     null,  100,        '1944-05-01'), /* авиационный
                                                                                                                  бомбардировщики и разведчики */
    (39, 'РЛС Tachi-18',    'radar Tachi-18',   8,      4000,       100,       50,  400,        '01-02-1943'), /* наземная */
    (40, 'РЛС Tachi-7',     'radar Tachi-7',    8,     18000,       100,       50, null,        '01-04-1943'), /* наземная */
    (41, 'РЛС Tachi-6',     'radar Tachi-6',    8,      null,        85,       50,  350,        '01-06-1942'); /* наземная */



insert into searchers
    (id, name_ru,                   name_en,                   class_id,    mass,  frequency,   power, build_cnt,   in_service)
    values                                                                      /* видимый свет */
    (34, '110см прожектор',         '110cm searhlight',             13,     null,   560000000,  null,   null,        null),
    (29, '110см прожектор Sperry',  '110cm searhlight Sperry',      13,     null,   560000000,  null,   null,       '1925-01-01'),
    (30, '110см прожектор тип 92',  '110cm searhlight type 92',     13,     null,   560000000,  null,   null,       '1933-01-01'),
    (35, '150см прожектор',         '150cm searhlight',             13,     null,   560000000,  null,   null,        null),
    (31, '150см прожектор тип 96',  '150cm searhlight type 96',     13,     null,   560000000,  null,   null,       '1937-01-01'),
    (36, '90см прожектор Sperry',   '90cm searhlight Sperry',       13,     null,   560000000,  null,   null,        null),
    (32, '90см прожектор тип 96',   '90cm searhlight type 96',      13,     null,   560000000,  null,   null,       '1936-01-01'),
    (37, '60см прожектор',          '60cm searhlight',              13,     null,   560000000,  null,   null,        null),
    (33, '60см прожектор тип 94',   '60cm searhlight type 94',      13,     null,   560000000,  null,   null,       '1934-01-01'),
    (38, '40см прожектор',          '40cm searhlight',              13,     null,   560000000,  null,   null,        null);
          

    

insert into target_class
    (id, parent_id, name_ru, name_en)
    values
    (0, null,   'самолет',                          'aircraft'),
    (1, 0,      'группа самолетов',                 'aircraft group'),
    (2, null,   'корабль',                          'ship'),
    (3, null,   'поверхность',                      'earth or ocean surface'),
    (4, null,   'использование радара / радио',     'radar / radio usage');



insert into searchers_range
    (searcher_id, target_class_id, range)
    values
    (3, 0, 130),
    (3, 1, 250),
    
    (4, 0, 50),
    (4, 1, 100),
    
    (2, 0, 50),
    (2, 1, 100),

    (5, 0, 250),
    (5, 1, 360),

    (0, 0, 70),
    (0, 1, 100),
    (0, 2, 20),

    (1, 0, 17),
    (1, 1, 35),
    (1, 2, 34.5),

    (6, 0, 70),
    (6, 1, 100),

    (7, 0, 70),
    (7, 1, 100),
    
    (8, 0, 50),
    (8, 1, 70),
    
    (9, 0, 50),
    (9, 1, 70),
    
    (10, 0, 20),
    (10, 1, 40),
    
    (11, 0, 20),
    (11, 1, 40),
    
    (12, 0, 40),
    (12, 1, 40),
    
    (13, 2, 13),
    (14, 2, 35),
    (15, 2, 30),
    (16, 2, 13),
    
    (17, 0, 3),
    (17, 1, null),
    (17, 2, 10),
    
    (18, 0, 3),
    (18, 1, null),
    
    (19, 0, 130),
    (19, 1, null),
    
    (20, 0, 100),
    (20, 1, null),

    (21, 0, 160),
    (21, 1, null),
    
    (22, 2, 20),
    (23, 2, 100),
    
    (24, 3, 20),
    (25, 3, 0.015),

    (26, 4, 300),
    (27, 4, 300),
    (28, 4, 300),
    
    (39, 1, 200),
    (40, 0, 150),
    (40, 1, 150),
    (41, 1, 200);
    

